ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper_hal.c
/**
 ******************************************************************************
 * @file    stm32f4xx_hal_i2c.c
 * @author  MCD Application Team
 * @version V1.2.0
 * @date    26-December-2014
 * @brief   I2C HAL module driver.
 *          This file provides firmware functions to manage the following
 *          functionalities of the Inter Integrated Circuit (I2C) peripheral:
 *           + Initialization and de-initialization functions
 *           + IO operation functions
 *           + Peripheral Control functions
 *           + Peripheral State functions
 *
 @verbatim
 ==============================================================================
 ##### How to use this driver #####
 ==============================================================================
 [..]
 The I2C HAL driver can be used as follows:

 (#) Declare a I2C_HandleTypeDef handle structure, for example:
 I2C_HandleTypeDef  hi2c;

 (#)Initialize the I2C low level resources by implement the HAL_I2C_MspInit() API:
 (##) Enable the I2Cx interface clock
 (##) I2C pins configuration
 (+++) Enable the clock for the I2C GPIOs
 (+++) Configure I2C pins as alternate function open-drain
 (##) NVIC configuration if you need to use interrupt process
 (+++) Configure the I2Cx interrupt priority
 (+++) Enable the NVIC I2C IRQ Channel
 (##) DMA Configuration if you need to use DMA process
 (+++) Declare a DMA_HandleTypeDef handle structure for the transmit or receive stream
 (+++) Enable the DMAx interface clock using
 (+++) Configure the DMA handle parameters
 (+++) Configure the DMA Tx or Rx Stream
 (+++) Associate the initialized DMA handle to the hi2c DMA Tx or Rx handle
 (+++) Configure the priority and enable the NVIC for the transfer complete interrupt on
 the DMA Tx or Rx Stream

 (#) Configure the Communication Speed, Duty cycle, Addressing mode, Own Address1,
 Dual Addressing mode, Own Address2, General call and Nostretch mode in the hi2c Init structure.

 (#) Initialize the I2C registers by calling the HAL_I2C_Init(), configures also the low level Hardware
 (GPIO, CLOCK, NVIC...etc) by calling the customized HAL_I2C_MspInit(&hi2c) API.

 (#) To check if target device is ready for communication, use the function HAL_I2C_IsDeviceReady()

 (#) For I2C IO and IO MEM operations, three operation modes are available within this driver :

 *** Polling mode IO operation ***
 =================================
 [..]
 (+) Transmit in master mode an amount of data in blocking mode using HAL_I2C_Master_Transmit()
 (+) Receive in master mode an amount of data in blocking mode using HAL_I2C_Master_Receive()
 (+) Transmit in slave mode an amount of data in blocking mode using HAL_I2C_Slave_Transmit()
 (+) Receive in slave mode an amount of data in blocking mode using HAL_I2C_Slave_Receive()

 *** Polling mode IO MEM operation ***
 =====================================
 [..]
 (+) Write an amount of data in blocking mode to a specific memory address using HAL_I2C_Mem_Write()
 (+) Read an amount of data in blocking mode from a specific memory address using HAL_I2C_Mem_Read()


 *** Interrupt mode IO operation ***
 ===================================
 [..]
 (+) Transmit in master mode an amount of data in non blocking mode using HAL_I2C_Master_Transmit_IT()
 (+) At transmission end of transfer HAL_I2C_MasterTxCpltCallback is executed and user can
 add his own code by customization of function pointer HAL_I2C_MasterTxCpltCallback
 (+) Receive in master mode an amount of data in non blocking mode using HAL_I2C_Master_Receive_IT()
 (+) At reception end of transfer HAL_I2C_MasterRxCpltCallback is executed and user can
 add his own code by customization of function pointer HAL_I2C_MasterRxCpltCallback
 (+) Transmit in slave mode an amount of data in non blocking mode using HAL_I2C_Slave_Transmit_IT()
 (+) At transmission end of transfer HAL_I2C_SlaveTxCpltCallback is executed and user can
 add his own code by customization of function pointer HAL_I2C_SlaveTxCpltCallback
 (+) Receive in slave mode an amount of data in non blocking mode using HAL_I2C_Slave_Receive_IT()
 (+) At reception end of transfer HAL_I2C_SlaveRxCpltCallback is executed and user can
 add his own code by customization of function pointer HAL_I2C_SlaveRxCpltCallback
 (+) In case of transfer Error, HAL_I2C_ErrorCallback() function is executed and user can
 add his own code by customization of function pointer HAL_I2C_ErrorCallback

 *** Interrupt mode IO MEM operation ***
 =======================================
 [..]
 (+) Write an amount of data in no-blocking mode with Interrupt to a specific memory address using
 HAL_I2C_Mem_Write_IT()
 (+) At MEM end of write transfer HAL_I2C_MemTxCpltCallback is executed and user can
 add his own code by customization of function pointer HAL_I2C_MemTxCpltCallback
 (+) Read an amount of data in no-blocking mode with Interrupt from a specific memory address using
 HAL_I2C_Mem_Read_IT()
 (+) At MEM end of read transfer HAL_I2C_MemRxCpltCallback is executed and user can
 add his own code by customization of function pointer HAL_I2C_MemRxCpltCallback
 (+) In case of transfer Error, HAL_I2C_ErrorCallback() function is executed and user can
 add his own code by customization of function pointer HAL_I2C_ErrorCallback

 *** DMA mode IO operation ***
 ==============================
 [..]
 (+) Transmit in master mode an amount of data in non blocking mode (DMA) using
 HAL_I2C_Master_Transmit_DMA()
 (+) At transmission end of transfer HAL_I2C_MasterTxCpltCallback is executed and user can
 add his own code by customization of function pointer HAL_I2C_MasterTxCpltCallback
 (+) Receive in master mode an amount of data in non blocking mode (DMA) using
 HAL_I2C_Master_Receive_DMA()
 (+) At reception end of transfer HAL_I2C_MasterRxCpltCallback is executed and user can
 add his own code by customization of function pointer HAL_I2C_MasterRxCpltCallback
 (+) Transmit in slave mode an amount of data in non blocking mode (DMA) using
 HAL_I2C_Slave_Transmit_DMA()
 (+) At transmission end of transfer HAL_I2C_SlaveTxCpltCallback is executed and user can
 add his own code by customization of function pointer HAL_I2C_SlaveTxCpltCallback
 (+) Receive in slave mode an amount of data in non blocking mode (DMA) using
 HAL_I2C_Slave_Receive_DMA()
 (+) At reception end of transfer HAL_I2C_SlaveRxCpltCallback is executed and user can
 add his own code by customization of function pointer HAL_I2C_SlaveRxCpltCallback
 (+) In case of transfer Error, HAL_I2C_ErrorCallback() function is executed and user can
 add his own code by customization of function pointer HAL_I2C_ErrorCallback

 *** DMA mode IO MEM operation ***
 =================================
 [..]
 (+) Write an amount of data in no-blocking mode with DMA to a specific memory address using
 HAL_I2C_Mem_Write_DMA()
 (+) At MEM end of write transfer HAL_I2C_MemTxCpltCallback is executed and user can
 add his own code by customization of function pointer HAL_I2C_MemTxCpltCallback
 (+) Read an amount of data in no-blocking mode with DMA from a specific memory address using
 HAL_I2C_Mem_Read_DMA()
 (+) At MEM end of read transfer HAL_I2C_MemRxCpltCallback is executed and user can
 add his own code by customization of function pointer HAL_I2C_MemRxCpltCallback
 (+) In case of transfer Error, HAL_I2C_ErrorCallback() function is executed and user can
 add his own code by customization of function pointer HAL_I2C_ErrorCallback


 *** I2C HAL driver macros list ***
 ==================================
 [..]
 Below the list of most used macros in I2C HAL driver.

