ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper_hal.c
 (+) __HAL_I2C_ENABLE: Enable the I2C peripheral
 (+) __HAL_I2C_DISABLE: Disable the I2C peripheral
 (+) __HAL_I2C_GET_FLAG : Checks whether the specified I2C flag is set or not
 (+) __HAL_I2C_CLEAR_FLAG : Clear the specified I2C pending flag
 (+) __HAL_I2C_ENABLE_IT: Enable the specified I2C interrupt
 (+) __HAL_I2C_DISABLE_IT: Disable the specified I2C interrupt

 [..]
 (@) You can refer to the I2C HAL driver header file for more useful macros


 @endverbatim
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_i2c_helper_hal.h"

/** @addtogroup I2C_Helper
 * @{
 */

/** @defgroup I2C_Helper_HAL
 * @{
 */

#ifdef HAL_I2C_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @addtogroup I2C_Private_Constants
 * @{
 */
#define I2C_TIMEOUT_FLAG          ((uint32_t)35)     /* 35 ms */
#define I2C_TIMEOUT_ADDR_SLAVE    ((uint32_t)10000)  /* 10 s  */
/**
 * @}
 */

/* Private macro -------------------------------------------------------------*/

/** @addtogroup I2C_Private_Macros
 * @{
 */
#define I2C_CHECK_PEC(hi2c)			(((hi2c)->Instance->CR1 & I2C_PECMODE_ENABLE) == I2C_PECMODE_ENABLE)
/**
 * @}
 */

/* Private variables ---------------------------------------------------------*/

/** @addtogroup I2C_Helper_Private_Variables_Group3 DMA Variables
 * @brief DmaUsed variables for internal purpose.
 * @{
 */
static uint8_t HELPER_I2C1_dmaUsed; /*!< dmaUsed for the I2C1 peripheral */
static uint8_t HELPER_I2C2_dmaUsed; /*!< dmaUsed for the I2C2 peripheral */
static uint8_t HELPER_I2C3_dmaUsed; /*!< dmaUsed for the I2C3 peripheral */

/**
 * @}
 */
/* Private function prototypes -----------------------------------------------*/
/** @addtogroup I2C_Private_Functions
 * @{
 */

static void setDmaUsed(I2C_HandleTypeDef* hi2c, uint8_t newVal);
static uint8_t getDmaUsed(I2C_HandleTypeDef* hi2c);

/* New Callback *****************************************************************/
static void I2C_DMA_ITSlaveReceiveCplt(DMA_HandleTypeDef *hdma);
/********************************************************************************/
static void I2C_DMAError(DMA_HandleTypeDef *hdma);

static HAL_StatusTypeDef I2C_MasterRequestWrite(I2C_HandleTypeDef *hi2c,
		uint16_t DevAddress, uint32_t Timeout);
static HAL_StatusTypeDef I2C_MasterRequestRead(I2C_HandleTypeDef *hi2c,
		uint16_t DevAddress, uint32_t Timeout);
static HAL_StatusTypeDef I2C_WaitOnFlagUntilTimeout(I2C_HandleTypeDef *hi2c,
		uint32_t Flag, FlagStatus Status, uint32_t Timeout);
static HAL_StatusTypeDef I2C_WaitOnMasterAddressFlagUntilTimeout(
		I2C_HandleTypeDef *hi2c, uint32_t Flag, uint32_t Timeout);

static HAL_StatusTypeDef I2C_MasterTransmit_TXE(I2C_HandleTypeDef *hi2c);
static HAL_StatusTypeDef I2C_MasterTransmit_BTF(I2C_HandleTypeDef *hi2c);
static HAL_StatusTypeDef I2C_MasterReceive_RXNE(I2C_HandleTypeDef *hi2c);
static HAL_StatusTypeDef I2C_MasterReceive_BTF(I2C_HandleTypeDef *hi2c);

static HAL_StatusTypeDef I2C_SlaveTransmit_TXE(I2C_HandleTypeDef *hi2c);
static HAL_StatusTypeDef I2C_SlaveTransmit_BTF(I2C_HandleTypeDef *hi2c);
static HAL_StatusTypeDef I2C_SlaveReceive_RXNE(I2C_HandleTypeDef *hi2c);
static HAL_StatusTypeDef I2C_SlaveReceive_BTF(I2C_HandleTypeDef *hi2c);
static HAL_StatusTypeDef I2C_Slave_ADDR(I2C_HandleTypeDef *hi2c);
static HAL_StatusTypeDef I2C_Slave_STOPF(I2C_HandleTypeDef *hi2c);
static HAL_StatusTypeDef I2C_Slave_AF(I2C_HandleTypeDef *hi2c);
/**
 * @}
 */

/* Exported functions --------------------------------------------------------*/
/** @defgroup I2C_Exported_Functions I2C Exported Functions
 * @{
 */

/** @defgroup I2C_Exported_Functions_Group1 Initialization and de-initialization functions
 *  @brief    Initialization and Configuration functions
 *
 * @{
 */

/**
 * @brief  Transmits in master mode an amount of data in blocking mode.
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @param  DevAddress: Target device address
 * @param  pData: Pointer to data buffer
 * @param  Size: Amount of data to be sent
 * @param  Timeout: Timeout duration
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_I2C_Master_Transmit_withPEC(I2C_HandleTypeDef *hi2c,
		uint16_t DevAddress, uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
	if (hi2c->State == HAL_I2C_STATE_READY)
	{
		if ((pData == NULL) || (Size == 0))
		{
			return HAL_ERROR;
		}

