ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper_hal.c
		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) == SET)
		{
			return HAL_BUSY;
		}

		/* Process Locked */
		__HAL_LOCK(hi2c);

		hi2c->State = HAL_I2C_STATE_BUSY_TX;
		hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

		/* Send Slave Address */
		if (I2C_MasterRequestWrite(hi2c, DevAddress, Timeout) != HAL_OK)
		{
			if (hi2c->ErrorCode == HAL_I2C_ERROR_AF)
			{
				/* Process Unlocked */
				__HAL_UNLOCK(hi2c);
				return HAL_ERROR;
			}
			else
			{
				/* Process Unlocked */
				__HAL_UNLOCK(hi2c);
				return HAL_TIMEOUT;
			}
		}

		/* Clear ADDR flag */
		__HAL_I2C_CLEAR_ADDRFLAG(hi2c);

		while (Size > 0)
		{
			/* Wait until TXE flag is set */
			if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_TXE, RESET, Timeout)
					!= HAL_OK)
			{
				return HAL_TIMEOUT;
			}

			/* Write data to DR */
			hi2c->Instance->DR = (*pData++);
			Size--;

			if ((__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BTF) == SET) && (Size != 0))
			{
				/* Write data to DR */
				hi2c->Instance->DR = (*pData++);
				Size--;
			}
		}

		/* Wait until TXE flag is set */
		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_TXE, RESET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/********************* PEC CODE ********************************/
		/* Check if the PecMode is enabled */
		if (I2C_CHECK_PEC(hi2c) && Size == 0)
		{
			/* The master enables PEC Byte transmission, */
			hi2c->Instance->CR1 |= I2C_CR1_PEC;
		}
		/***************************************************************/

		/* Generate Stop */
		hi2c->Instance->CR1 |= I2C_CR1_STOP;

		/* Wait until BUSY flag is reset */
		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		hi2c->State = HAL_I2C_STATE_READY;

		/* Process Unlocked */
		__HAL_UNLOCK(hi2c);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}

// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wconversion"
#endif

/**
 * @brief  Receives in master mode an amount of data in blocking mode.
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @param  DevAddress: Target device address
 * @param  pData: Pointer to data buffer
 * @param  Size: Amount of data to be sent
 * @param  Timeout: Timeout duration
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_I2C_Master_Receive_withPEC(I2C_HandleTypeDef *hi2c,
		uint16_t DevAddress, uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
	if (hi2c->State == HAL_I2C_STATE_READY)
	{
		if ((pData == NULL) || (Size == 0))
		{
			return HAL_ERROR;
		}

		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) == SET)
		{
			return HAL_BUSY;
		}

		/* Process Locked */
		__HAL_LOCK(hi2c);

		hi2c->State = HAL_I2C_STATE_BUSY_RX;
		hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

		/* Send Slave Address */
		if (I2C_MasterRequestRead(hi2c, DevAddress, Timeout) != HAL_OK)
		{
			if (hi2c->ErrorCode == HAL_I2C_ERROR_AF)
			{
				/* Process Unlocked */
				__HAL_UNLOCK(hi2c);
				return HAL_ERROR;
			}
			else
			{
				/* Process Unlocked */
				__HAL_UNLOCK(hi2c);
				return HAL_TIMEOUT;
			}
		}

		if (Size == 1 && !I2C_CHECK_PEC(hi2c))
		{
			/* Disable Acknowledge */
			hi2c->Instance->CR1 &= ~I2C_CR1_ACK;

			/* Clear ADDR flag */
			__HAL_I2C_CLEAR_ADDRFLAG(hi2c);

			/* Generate Stop */
			hi2c->Instance->CR1 |= I2C_CR1_STOP;
		}
		else if (Size == 2 || (Size == 1 && I2C_CHECK_PEC(hi2c)))
		{
			/* Disable Acknowledge */
			hi2c->Instance->CR1 &= ~I2C_CR1_ACK;

			/* Enable Pos */
			hi2c->Instance->CR1 |= I2C_CR1_POS;

			/* Clear ADDR flag */
			__HAL_I2C_CLEAR_ADDRFLAG(hi2c);
		}
		else
		{
			/* Enable Acknowledge */
			hi2c->Instance->CR1 |= I2C_CR1_ACK;

			/* Clear ADDR flag */
			__HAL_I2C_CLEAR_ADDRFLAG(hi2c);
		}

		while (Size > 0)
		{
			if (Size <= 3)
			{
				/* One byte */
				if (Size == 1)
				{
					/* Wait until RXNE flag is set */
					if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_RXNE, RESET,
							Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					/* Read data from DR */
					(*pData++) = hi2c->Instance->DR;
					Size--;
				}
				/* Two bytes */
				else if (Size == 2)
				{
					/* Wait until BTF flag is set */
					if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BTF, RESET,
							Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					/* Generate Stop, only if there isn't PECMODE */
					hi2c->Instance->CR1 |=
							!I2C_CHECK_PEC(hi2c) ?
							I2C_CR1_STOP :
													(uint32_t) 0x00000000;

					/* Read data from DR */
					(*pData++) = hi2c->Instance->DR;
					Size--;

					/* Read data from DR */
					(*pData++) = hi2c->Instance->DR;
					Size--;
				}
				/* 3 Last bytes */
				else
				{
					/* Wait until BTF flag is set */
					if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BTF, RESET,
							Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					/* Disable Acknowledge, only if there isn't PECMODE */
					hi2c->Instance->CR1 &=
							!I2C_CHECK_PEC(hi2c) ?
									~I2C_CR1_ACK : (uint32_t) 0xFFFFFFFF;

					/* Read data from DR */
					(*pData++) = hi2c->Instance->DR;
					Size--;

					/* Wait until BTF flag is set */
					if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BTF, RESET,
							Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					/* Generate Stop, only if there isn't PECMODE */
					hi2c->Instance->CR1 |=
							!I2C_CHECK_PEC(hi2c) ?
							I2C_CR1_STOP :
													(uint32_t) 0x00000000;

					/* Read data from DR */
					(*pData++) = hi2c->Instance->DR;
					Size--;

					/* Read data from DR */
					(*pData++) = hi2c->Instance->DR;
					Size--;
				}
			}
			else
			{
				/* Wait until RXNE flag is set */
				if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_RXNE, RESET,
						Timeout) != HAL_OK)
				{
					return HAL_TIMEOUT;
				}

				/* Read data from DR */
				(*pData++) = hi2c->Instance->DR;
				Size--;

				if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BTF) == SET)
				{
					/* Read data from DR */
					(*pData++) = hi2c->Instance->DR;
					Size--;
				}
			}
		}
		/********************* PEC CODE ********************************/
		/* Check if the PecMode is enabled */
		if (I2C_CHECK_PEC(hi2c) && Size == 0)
		{
			/* Master disables Acknowledge, in order to sends the final NACK */
			/* MUST BE DONE HERE! */
			hi2c->Instance->CR1 &= ~I2C_CR1_ACK;

			/* Master enables PEC Byte reception */
			hi2c->Instance->CR1 |= I2C_CR1_PEC;

			/* The master waits until RXNE flag is set, it means data register is NOT empty. */
			/* RxNE Event */
			if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_RXNE, RESET, Timeout)
					!= HAL_OK)
			{
				return HAL_TIMEOUT;
			}

			/* Master generates Stop */
			hi2c->Instance->CR1 |= I2C_CR1_STOP;

			/* Master should check for PEC Error */
			/* PER Error Event */
			if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_PECERR) == SET)
			{
				/* PEC Error, set the error code */
				hi2c->ErrorCode = HAL_I2C_ERROR_PEC;
				/* If there's a PEC Error, it's the application logic that decides what to do */
			}

			/* The slave reads the data, cleaning the RxNE */
			(*pData++) = hi2c->Instance->DR;
		}
		/***************************************************************/

		/* Disable Pos */
		hi2c->Instance->CR1 &= ~I2C_CR1_POS;

		/* Wait until BUSY flag is reset */
		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		hi2c->State = HAL_I2C_STATE_READY;

		/* Process Unlocked */
		__HAL_UNLOCK(hi2c);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}

/**
 * @brief  Transmits in slave mode an amount of data in blocking mode.
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @param  pData: Pointer to data buffer
 * @param  Size: Amount of data to be sent
 * @param  Timeout: Timeout duration
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_I2C_Slave_Transmit_withPEC(I2C_HandleTypeDef *hi2c,
		uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
	if (hi2c->State == HAL_I2C_STATE_READY)
	{
		if ((pData == NULL) || (Size == 0))
		{
			return HAL_ERROR;
		}

