ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper_hal.c
		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) == SET)
		{
			return HAL_BUSY;
		}

		/* Process Locked */
		__HAL_LOCK(hi2c);

		hi2c->State = HAL_I2C_STATE_BUSY_TX;
		hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

		/* Enable Address Acknowledge */
		hi2c->Instance->CR1 |= I2C_CR1_ACK;

		/* Wait until ADDR flag is set */
		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, RESET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* Clear ADDR flag */
		__HAL_I2C_CLEAR_ADDRFLAG(hi2c);

		/* If 10bit addressing mode is selected */
		if (hi2c->Init.AddressingMode == I2C_ADDRESSINGMODE_10BIT)
		{
			/* Wait until ADDR flag is set */
			if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, RESET, Timeout)
					!= HAL_OK)
			{
				return HAL_TIMEOUT;
			}

			/* Clear ADDR flag */
			__HAL_I2C_CLEAR_ADDRFLAG(hi2c);
		}

		while (Size > 0)
		{
			/* Wait until TXE flag is set */
			if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_TXE, RESET, Timeout)
					!= HAL_OK)
			{
				return HAL_TIMEOUT;
			}

			/* Write data to DR */
			hi2c->Instance->DR = (*pData++);
			Size--;

			if ((__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BTF) == SET) && (Size != 0))
			{
				/* Write data to DR */
				hi2c->Instance->DR = (*pData++);
				Size--;
			}
		}
		/********************* PEC CODE ********************************/
		/* Check if the PecMode is enabled */
		if (I2C_CHECK_PEC(hi2c) && Size == 0)
		{
			/* Slave waits until TXE flag is set */
			/* TxE Event */
			if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_TXE, RESET, Timeout)
					!= HAL_OK)
			{
				return HAL_TIMEOUT;
			}
			/* Slave sends the PEC Byte after the last one */
			hi2c->Instance->CR1 |= I2C_CR1_PEC;
		}
		/***************************************************************/

		/* Wait until AF flag is set */
		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_AF, RESET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* Clear AF flag */
		__HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

		/* Disable Address Acknowledge */
		hi2c->Instance->CR1 &= ~I2C_CR1_ACK;

		/* Wait until BUSY flag is reset */
		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		hi2c->State = HAL_I2C_STATE_READY;

		/* Process Unlocked */
		__HAL_UNLOCK(hi2c);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}

/**
 * @brief  Receive in slave mode an amount of data in blocking mode
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @param  pData: Pointer to data buffer
 * @param  Size: Amount of data to be sent
 * @param  Timeout: Timeout duration
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_I2C_Slave_Receive_withPEC(I2C_HandleTypeDef *hi2c,
		uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
	if (hi2c->State == HAL_I2C_STATE_READY)
	{
		if ((pData == NULL) || (Size == 0))
		{
			return HAL_ERROR;
		}

		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) == SET)
		{
			return HAL_BUSY;
		}

		/* Process Locked */
		__HAL_LOCK(hi2c);

		hi2c->State = HAL_I2C_STATE_BUSY_RX;
		hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

		/* Enable Address Acknowledge */
		hi2c->Instance->CR1 |= I2C_CR1_ACK;

		/* Wait until ADDR flag is set */
		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, RESET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* Clear ADDR flag */
		__HAL_I2C_CLEAR_ADDRFLAG(hi2c);

		while (Size > 0)
		{
			/* Wait until RXNE flag is set */
			if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_RXNE, RESET, Timeout)
					!= HAL_OK)
			{
				return HAL_TIMEOUT;
			}

			/* Read data from DR */
			(*pData++) = hi2c->Instance->DR;
			Size--;

			if ((__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BTF) == SET) && (Size != 0))
			{
				/* Read data from DR */
				(*pData++) = hi2c->Instance->DR;
				Size--;
			}
		}

		/********************* PEC CODE ********************************/
		/* Check if the PecMode is enabled */
		if (I2C_CHECK_PEC(hi2c) && Size == 0)
		{
			/* Slave enables PEC Byte reception */
			hi2c->Instance->CR1 |= I2C_CR1_PEC;
		}
		/***************************************************************/

		/* Wait until STOP flag is set */
		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_STOPF, RESET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/********************* PEC CODE - Cont *************************/
		/* Check if the PecMode is enabled */
		if (I2C_CHECK_PEC(hi2c) && Size == 0)
		{
			/* Slave should check for PEC Error */
			/* PER Error Event */
			if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_PECERR) == SET)
			{
				/* PEC Error, set the error code */
				hi2c->ErrorCode = HAL_I2C_ERROR_PEC;
				/* If there's a PEC Error, it's the application logic that
				 * decides what to do */
			}

			/* The slave reads the PEC Byte, cleaning the RxNE */
			(*pData) = hi2c->Instance->DR;
		}
		/***************************************************************/

		/* Clear STOP flag */
		__HAL_I2C_CLEAR_STOPFLAG(hi2c);

		/* Disable Address Acknowledge */
		hi2c->Instance->CR1 &= ~I2C_CR1_ACK;

		/* Wait until BUSY flag is reset */
		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		hi2c->State = HAL_I2C_STATE_READY;

		/* Process Unlocked */
		__HAL_UNLOCK(hi2c);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}

/** @defgroup Self_I2C_Exported_Functions Exported Functions
 * @ Utility functions for master/slave transmitting and receiving.
 * @{
 */

/**
 * @brief Master 'hi2c_master' transmits in polling mode 'Size' data pointed
 * 		  by 'txData' to 'hi2c_slave' that save it in 'rxData' with 'Timeout' as timeout.
 * @param hi2c_master: I2C Master Handle.
 * @param hi2c_slave : I2C Slave Handle.
 * @param txData	 : Pointer to the data transfered by the master.
 * @param rxData	 : Pointer to the data received by the slave.
 * @param Size		 : The size of the data.
 * @param Timeout	 : Timeout of polling waiting.
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_I2C_Master_Transmit_onBoard(
		I2C_HandleTypeDef *hi2c_master, I2C_HandleTypeDef *hi2c_slave,
		uint8_t *txData, uint8_t *rxData, uint16_t Size, uint32_t Timeout)
{

	uint16_t masterSize = Size;

