ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper_hal.c
	/* Check if the master and the slave periph are ready */
	if (hi2c_master->State == HAL_I2C_STATE_READY
			&& hi2c_slave->State == HAL_I2C_STATE_READY)
	{
		/* Check if not-NULL data pointers and not-Zero Size has been provided */
		if ((txData == NULL) || (txData == NULL) || (Size == 0))
		{
			return HAL_ERROR;
		}

		/* Check, in both handles, if the flag BUSY (in SR2) is SET , it would mean that there is
		 * a communication on the bus, id est SCL or SDA are low.
		 */
		if (__HAL_I2C_GET_FLAG(hi2c_master, I2C_FLAG_BUSY) == SET
				|| __HAL_I2C_GET_FLAG(hi2c_slave, I2C_FLAG_BUSY) == SET)
		{
			return HAL_BUSY;
		}

		/* Process Locked, lock the handle to avoid concurrent access */
		__HAL_LOCK(hi2c_master);
		__HAL_LOCK(hi2c_slave);

		/* Change the state of the master */
		hi2c_master->State = HAL_I2C_STATE_BUSY_TX;
		hi2c_master->ErrorCode = HAL_I2C_ERROR_NONE;

		/* Change the state of the slave */
		hi2c_slave->State = HAL_I2C_STATE_BUSY_RX;
		hi2c_slave->ErrorCode = HAL_I2C_ERROR_NONE;

		/*
		 * This is the problem on the same board, the ACK it has to be enabled via software.
		 */
		/* The slave enables the Address Acknowledge */
		hi2c_slave->Instance->CR1 |= I2C_CR1_ACK;

		/* The master sends the Slave Address */
		if (I2C_MasterRequestWrite(hi2c_master, hi2c_slave->Init.OwnAddress1,
				Timeout) != HAL_OK)
		{
			if (hi2c_master->ErrorCode == HAL_I2C_ERROR_AF)
			{ /* Acknowledge failure */
				/* Process Unlocked */
				__HAL_UNLOCK(hi2c_master);
				return HAL_ERROR;
			}
			else
			{ /* The retry time is over */
				/* Process Unlocked */
				__HAL_UNLOCK(hi2c_master);
				return HAL_TIMEOUT;
			}
		}

		/* The slave has responded so the ADDR flag has been set now
		 * The master clears the ADDR flag */
		__HAL_I2C_CLEAR_ADDRFLAG(hi2c_master);

		/* The Slave waits until ADDR flag is set (wait if ADDR is RESET) */
		/* The ADDR event for the slave */
		if (I2C_WaitOnFlagUntilTimeout(hi2c_slave, I2C_FLAG_ADDR, RESET,
				Timeout) != HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* Slave clears ADDR flag */
		__HAL_I2C_CLEAR_ADDRFLAG(hi2c_slave);

		/* The master is in transmitter mode, the slave in receive mode
		 * Begin the transmission
		 */
		while (Size > 0)
		{
			/* The master wait until TXE flag is set, it means that DSR is empty,
			 * if it isn't the first transmission it also means that an ACK for the
			 * previous data has been received, in case of a NACK TxE is not set */
			/* TxE Event */
			if (I2C_WaitOnFlagUntilTimeout(hi2c_master, I2C_FLAG_TXE, RESET,
					Timeout) != HAL_OK)
			{
				return HAL_TIMEOUT;
			}

			/* The master can write data to DR (that will be copied in the DSR to start the transfer)
			 * clearing the TxE */
			hi2c_master->Instance->DR = (*txData++);
			masterSize--;

			/* The master checks if the data has already been transferred, and so if there's another
			 * to transfer it can do it (as expected DSR is like a buffer) */
			/* BTF Event */
			if ((__HAL_I2C_GET_FLAG(hi2c_master, I2C_FLAG_BTF) == SET)
					&& (masterSize > 0))
			{
				/* The master writes the other data to DR, clearing the BTF */
				hi2c_master->Instance->DR = (*txData++);
				masterSize--;
			}

			/* The master waits until TxE flag is set, it's waiting for the end of the serial transmission */
			/* TxE Event */
			if (I2C_WaitOnFlagUntilTimeout(hi2c_master, I2C_FLAG_TXE, RESET,
					Timeout) != HAL_OK)
			{
				return HAL_TIMEOUT;
			}
			/* At this point the master is already ready for another transmission */

			/* The slave waits until RxNE flag is set, it means DSR (and so the DR) is NOT empty id est
			 * something has been received */
			/* RxNE Event */
			if (I2C_WaitOnFlagUntilTimeout(hi2c_slave, I2C_FLAG_RXNE, RESET,
					Timeout) != HAL_OK)
			{
				return HAL_TIMEOUT;
			}

			/* The slave reads data from DR, clearing the RxNE */
			(*rxData++) = hi2c_slave->Instance->DR;
			Size--;

			/* The slave checks if another data has been received in DSR */
			/* BTF Event */
			if ((__HAL_I2C_GET_FLAG(hi2c_slave, I2C_FLAG_BTF) == SET)
					&& (Size != 0))
			{
				/* The slave reads data from DR, clearing the BTF */
				(*rxData++) = hi2c_slave->Instance->DR;
				Size--;
			}

			/********************* PEC CODE *****************************************/
			/* Check if the PecMode is enabled for both and it's the last byte transferred/received */
			if (I2C_CHECK_PEC(hi2c_master) && I2C_CHECK_PEC(hi2c_slave)
					&& Size == 0)
			{
				/* The master enables PEC Byte transmission, */
				hi2c_master->Instance->CR1 |= I2C_CR1_PEC;

				/* The master MUST NOT wait until TXE flag is set, because the pec transmission
				 * doens't fire the TxE Event */
//				if (I2C_WaitOnFlagUntilTimeout(hi2c_master, I2C_FLAG_TXE, RESET,
//						Timeout) != HAL_OK) {
//					return HAL_TIMEOUT;
//				}
				/* The slave enables PEC Byte reception */
				hi2c_slave->Instance->CR1 |= I2C_CR1_PEC;

				/* The slave waits until RXNE flag is set, it means data register is NOT empty. */
				/* RxNE Event */
				if (I2C_WaitOnFlagUntilTimeout(hi2c_slave, I2C_FLAG_RXNE, RESET,
						Timeout) != HAL_OK)
				{
					return HAL_TIMEOUT;
				}

				/* The slave should check for PEC Error */
				/* PER Error Event */
				if (__HAL_I2C_GET_FLAG(hi2c_slave, I2C_FLAG_PECERR) == SET)
				{
					/* PEC Error, set the error code */
					hi2c_slave->ErrorCode = HAL_I2C_ERROR_PEC;
					/* If there's a PEC Error, it's the application logic that decides what to do */
				}

				/* The slave reads the data, cleaning the RxNE */
				(*rxData++) = hi2c_slave->Instance->DR;
			}
			/************************************************************************/
		}

		/* The master generates Stop condition */
		hi2c_master->Instance->CR1 |= I2C_CR1_STOP;

		/* The Slave waits until STOP flag is set */
		/* STOPF Event */
		if (I2C_WaitOnFlagUntilTimeout(hi2c_slave, I2C_FLAG_STOPF, RESET,
				Timeout) != HAL_OK)
		{
			return HAL_TIMEOUT;
		}

