ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper_hal.c
		/* The master clears STOP flag */
		__HAL_I2C_CLEAR_STOPFLAG(hi2c_slave);

		/* The slave disables Address Acknowledge */
		hi2c_slave->Instance->CR1 &= ~I2C_CR1_ACK;

		/* The slave wait until BUSY flag is reset,
		 * the slave has released the lines so it should see the lines high -> no communications */
		if (I2C_WaitOnFlagUntilTimeout(hi2c_slave, I2C_FLAG_BUSY, SET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* The master waits until BUSY flag is reset
		 * the master has released the lines so it should see the lines high -> no communications */
		if (I2C_WaitOnFlagUntilTimeout(hi2c_master, I2C_FLAG_BUSY, SET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* Update the periph state */
		hi2c_slave->State = HAL_I2C_STATE_READY;
		hi2c_master->State = HAL_I2C_STATE_READY;

		/* Process Unlocked */
		__HAL_UNLOCK(hi2c_master);
		__HAL_UNLOCK(hi2c_slave);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}

/**
 * @brief Slave 'hi2c_slave' transmits in polling mode 'Size' datas pointed
 * 		  by 'txData' to 'hi2c_master' that save it in 'rxData' with 'Timeout' as a timeout.
 * @param hi2c_master: I2C Master Handler.
 * @param hi2c_slave : I2C Slave Handler
 * @param txData	 : Pointer to the data transfered by the master.
 * @param rxData	 : Pointer to the data received by the slave.
 * @param Size		 : The size of the data.
 * @param Timeout	 : Timeout of polling waiting.
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_I2C_Slave_Transmit_onBoard(I2C_HandleTypeDef *hi2c_master,
		I2C_HandleTypeDef *hi2c_slave, uint8_t *txData, uint8_t *rxData,
		uint16_t Size, uint32_t Timeout)
{

	/*************************************************************************
	 * This function is partially commented, read masterTransmitSlaveReceive *
	 * first to properly understand all the events flow.					 *
	 *************************************************************************/

	uint16_t slaveSize = Size;

	if (hi2c_master->State == HAL_I2C_STATE_READY
			&& hi2c_slave->State == HAL_I2C_STATE_READY)
	{
		if ((txData == NULL) || (rxData == NULL) || (Size == 0))
		{
			return HAL_ERROR;
		}

		if (__HAL_I2C_GET_FLAG(hi2c_master, I2C_FLAG_BUSY) == SET
				|| __HAL_I2C_GET_FLAG(hi2c_slave, I2C_FLAG_BUSY) == SET)
		{
			return HAL_BUSY;
		}

		/* Process Locked */
		__HAL_LOCK(hi2c_master);
		__HAL_LOCK(hi2c_slave);

		hi2c_master->State = HAL_I2C_STATE_BUSY_RX;
		hi2c_master->ErrorCode = HAL_I2C_ERROR_NONE;

		hi2c_slave->State = HAL_I2C_STATE_BUSY_TX;
		hi2c_slave->ErrorCode = HAL_I2C_ERROR_NONE;

		/* Slave enables Address Acknowledge */
		hi2c_slave->Instance->CR1 |= I2C_CR1_ACK;

		/* Master sends Slave Address */
		if (I2C_MasterRequestRead(hi2c_master, hi2c_slave->Init.OwnAddress1,
				Timeout) != HAL_OK)
		{
			if (hi2c_master->ErrorCode == HAL_I2C_ERROR_AF)
			{
				/* Process Unlocked */
				__HAL_UNLOCK(hi2c_master);
				return HAL_ERROR;
			}
			else
			{
				/* Process Unlocked */
				__HAL_UNLOCK(hi2c_master);
				return HAL_TIMEOUT;
			}
		}

		/* Slave waits until ADDR flag is set */
		/* ADDR Event */
		if (I2C_WaitOnFlagUntilTimeout(hi2c_slave, I2C_FLAG_ADDR, RESET,
				Timeout) != HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* Slave clears ADDR flag */
		__HAL_I2C_CLEAR_ADDRFLAG(hi2c_slave);

		/* If 10bit addressing mode is selected */
		if (hi2c_slave->Init.AddressingMode == I2C_ADDRESSINGMODE_10BIT)
		{
			/* Wait until ADDR flag is set */
			/* ADDR Event */
			if (I2C_WaitOnFlagUntilTimeout(hi2c_slave, I2C_FLAG_ADDR, RESET,
					Timeout) != HAL_OK)
			{
				return HAL_TIMEOUT;
			}

			/* Clear ADDR flag */
			__HAL_I2C_CLEAR_ADDRFLAG(hi2c_slave);
		}

		/* Master receive-mode configuration,
		 * it's necessary because the ADDR clearing has to be done in a certain order */
		if (Size == 1 && !I2C_CHECK_PEC(hi2c_master))
		{
			/* Only one byte */
			/* Master disables Acknowledge, in order to sends the final NACK */
			hi2c_master->Instance->CR1 &= ~I2C_CR1_ACK;

			/* Master clears ADDR flag */
			__HAL_I2C_CLEAR_ADDRFLAG(hi2c_master);

			/* Master generates Stop condition */
			hi2c_master->Instance->CR1 |= I2C_CR1_STOP;
		}
		else if (Size == 2 || (Size == 1 && I2C_CHECK_PEC(hi2c_master)))
		{
			/* Two byte, after the first one the second one will immediately
			 * saved in the DSR */
			/* Master disables Acknowledge, in order to sends the final NACK */
			hi2c_master->Instance->CR1 &= ~I2C_CR1_ACK;

			/* Master enable Pos, ACK Position bit
			 * it'used only if the master has to receive 2 bytes */
			hi2c_master->Instance->CR1 |= I2C_CR1_POS;

			/* Master clears ADDR flag */
			__HAL_I2C_CLEAR_ADDRFLAG(hi2c_master);
		}
		else
		{
			/* Master enables Acknowledge, because it has to responde
			 * to the byte-transmission of the slave */
			hi2c_master->Instance->CR1 |= I2C_CR1_ACK;

			/* Master clears ADDR flag */
			__HAL_I2C_CLEAR_ADDRFLAG(hi2c_master);
		}

		/* The master is in receive mode, the slave in transmit mode
		 * Begin the transmission */
		while (Size > 0)
		{
			/* Slave waits until TXE flag is set */
			/* TxE Event */
			if (I2C_WaitOnFlagUntilTimeout(hi2c_slave, I2C_FLAG_TXE, RESET,
					Timeout) != HAL_OK)
			{
				return HAL_TIMEOUT;
			}

			/* Slave writes data to DR */
			hi2c_slave->Instance->DR = (*txData++);
			slaveSize--;

			/* I don't know why but this delay it's needed */
			HAL_Delay(1);

			/* If there's another byte to send */
			/* BTF Event */
			if ((__HAL_I2C_GET_FLAG(hi2c_slave, I2C_FLAG_BTF) == SET)
					&& (slaveSize > 0))
			{
				/* Slave writes another data to DR */
				hi2c_slave->Instance->DR = (*txData++);
				slaveSize--;
			}

			/***************************************************************************
			 * The master receive is implemented in a recursive way, the master reads
			 * at most 2 byte at time, and it differentiates if it has to receive <=3 o >3
			 * bytes.
			 ***************************************************************************/
			if (Size <= 3)
			{
				/* One byte */
				if (Size == 1)
				{
					/* Master waits until RXNE flag is set */
					/* RxNE Event */
					if (I2C_WaitOnFlagUntilTimeout(hi2c_master,
					I2C_FLAG_RXNE, RESET, Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					/* Master reads data from DR */
					(*rxData++) = hi2c_master->Instance->DR;
					Size--;

