ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper_hal.c
				}
				/* Two bytes */
				else if (Size == 2)
				{
					/* Master waits until BTF flag is set */
					/* BTF Event */
					if (I2C_WaitOnFlagUntilTimeout(hi2c_master,
					I2C_FLAG_BTF, RESET, Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

//					/* Master generates Stop */
//					hi2c_master->Instance->CR1 |= I2C_CR1_STOP;

					/* Two consecutive read */
					/* Master reads data from DR */
					(*rxData++) = hi2c_master->Instance->DR;
					Size--;

					/* Master reads data from DR */
					(*rxData++) = hi2c_master->Instance->DR;
					Size--;

				}
				/* 3 Last bytes */
				else
				{
					/* Master waits until BTF flag is set */
					/* BTF Event */
					if (I2C_WaitOnFlagUntilTimeout(hi2c_master,
					I2C_FLAG_BTF, RESET, Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					/* Master disables Acknowledge, in order to sends the final NACK */
//					hi2c_master->Instance->CR1 &= ~I2C_CR1_ACK;
					/* Master reads data from DR */
					(*rxData++) = hi2c_master->Instance->DR;
					Size--;

					/* Master waits until BTF flag is set */
					/* BTF Event */
					if (I2C_WaitOnFlagUntilTimeout(hi2c_master,
					I2C_FLAG_BTF, RESET, Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					/* The rest is the same as 2 byte */

					/* Master generates Stop */
//					hi2c_master->Instance->CR1 |= I2C_CR1_STOP;
					/* Two consecutive read */
					/* Master reads data from DR */
					(*rxData++) = hi2c_master->Instance->DR;
					Size--;

					/* Master reads data from DR */
					(*rxData++) = hi2c_master->Instance->DR;
					Size--;

				}
			}
			else
			{
				/* More than 3 bytes */
				/* Master waits until RXNE flag is set */
				/* RxNE Event */
				if (I2C_WaitOnFlagUntilTimeout(hi2c_master, I2C_FLAG_RXNE,
						RESET, Timeout) != HAL_OK)
				{
					return HAL_TIMEOUT;
				}

				/* Master reads data from DR */
				(*rxData++) = hi2c_master->Instance->DR;
				Size--;

				/* Master checks if BTF flag is set, maybe another data is arrived */
				/* BTF Event */
				if (__HAL_I2C_GET_FLAG(hi2c_master, I2C_FLAG_BTF) == SET)
				{
					/* Master reads data from DR */
					(*rxData++) = hi2c_master->Instance->DR;
					Size--;
				}
			}
			/* Last byte */
			if (Size == 0)
			{
				/********************* PEC CODE *****************************************/
				/* Check if the PecMode is enabled for both */
				if (I2C_CHECK_PEC(hi2c_master) && I2C_CHECK_PEC(hi2c_slave))
				{

					/* Slave waits until TXE flag is set */
					/* TxE Event */
					if (I2C_WaitOnFlagUntilTimeout(hi2c_slave, I2C_FLAG_TXE,
							RESET, Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					/* Slave sends the PEC Byte after the last */
					hi2c_slave->Instance->CR1 |= I2C_CR1_PEC;
					/* This code take the PEC Byte from the SR2 */
//					uint32_t PecByte = (hi2c_slave->Instance->SR2 & 0xFF00)
//							>> 8;
					/* Master disables Acknowledge, in order to sends the final NACK */
					/* MUST BE DONE HERE! */
					hi2c_master->Instance->CR1 &= ~I2C_CR1_ACK;

					/* Master enables PEC Byte reception */
					hi2c_master->Instance->CR1 |= I2C_CR1_PEC;

					/* The master waits until RXNE flag is set, it means data register is NOT empty. */
					/* RxNE Event */
					if (I2C_WaitOnFlagUntilTimeout(hi2c_master,
					I2C_FLAG_RXNE, RESET, Timeout) != HAL_OK)
					{
						return HAL_TIMEOUT;
					}

					/* Master should check for PEC Error */
					/* PER Error Event */
					if (__HAL_I2C_GET_FLAG(hi2c_master, I2C_FLAG_PECERR) == SET)
					{
						/* PEC Error, set the error code */
						hi2c_master->ErrorCode = HAL_I2C_ERROR_PEC;
						/* If there's a PEC Error, it's the application logic that decides what to do */
					}

					/* The slave reads the data, cleaning the RxNE */
					(*rxData++) = hi2c_master->Instance->DR;

				}
				else
				{
					hi2c_master->Instance->CR1 &= ~I2C_CR1_ACK;
				}
				/************************************************************************/
				/* Master generates Stop */
				hi2c_master->Instance->CR1 |= I2C_CR1_STOP;
			}
		}

		/* Master Disables Pos */
		hi2c_master->Instance->CR1 &= ~I2C_CR1_POS;

		/* Slave waits until AF flag is set */
		/* AF Event */
		if (I2C_WaitOnFlagUntilTimeout(hi2c_slave, I2C_FLAG_AF, RESET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* Slave clears AF flag */
		__HAL_I2C_CLEAR_FLAG(hi2c_slave, I2C_FLAG_AF);

		/* Slave disables Address Acknowledge */
		hi2c_slave->Instance->CR1 &= ~I2C_CR1_ACK;

		/* Slave waits until BUSY flag is reset */
		if (I2C_WaitOnFlagUntilTimeout(hi2c_slave, I2C_FLAG_BUSY, SET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* Master waits until BUSY flag is reset */
		if (I2C_WaitOnFlagUntilTimeout(hi2c_master, I2C_FLAG_BUSY, SET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* Put the state to READY */
		hi2c_master->State = HAL_I2C_STATE_READY;
		hi2c_slave->State = HAL_I2C_STATE_READY;

		/* Process Unlocked */
		__HAL_UNLOCK(hi2c_master);
		__HAL_UNLOCK(hi2c_slave);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}
/**
 * @}
 */

/**
 * @brief  Transmit in master mode an amount of data in no-blocking mode with Interrupt
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @param  DevAddress: Target device address
 * @param  pData: Pointer to data buffer
 * @param  Size: Amount of data to be sent
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_I2C_Master_Transmit_IT_withPEC(I2C_HandleTypeDef *hi2c,
		uint16_t DevAddress, uint8_t *pData, uint16_t Size)
{
	if (hi2c->State == HAL_I2C_STATE_READY)
	{
		if ((pData == NULL) || (Size == 0))
		{
			return HAL_ERROR;
		}

		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) == SET)
		{
			return HAL_BUSY;
		}

		/* Process Locked */
		__HAL_LOCK(hi2c);

