ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper_hal.c
		hi2c->State = HAL_I2C_STATE_BUSY_TX;
		hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

		hi2c->pBuffPtr = pData;
		hi2c->XferSize = Size;
		hi2c->XferCount = Size;

		/* Send Slave Address */
		if (I2C_MasterRequestWrite(hi2c, DevAddress, I2C_TIMEOUT_FLAG)
				!= HAL_OK)
		{
			if (hi2c->ErrorCode == HAL_I2C_ERROR_AF)
			{
				/* Process Unlocked */
				__HAL_UNLOCK(hi2c);
				return HAL_ERROR;
			}
			else
			{
				/* Process Unlocked */
				__HAL_UNLOCK(hi2c);
				return HAL_TIMEOUT;
			}
		}

		/* Clear ADDR flag */
		__HAL_I2C_CLEAR_ADDRFLAG(hi2c);

		/* Process Unlocked */
		__HAL_UNLOCK(hi2c);

		/* Note : The I2C interrupts must be enabled after unlocking current process
		 to avoid the risk of I2C interrupt handle execution before current
		 process unlock */

		/* Enable EVT, BUF and ERR interrupt */
		__HAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}

/**
 * @brief  Receive in master mode an amount of data in no-blocking mode with Interrupt
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @param  DevAddress: Target device address
 * @param  pData: Pointer to data buffer
 * @param  Size: Amount of data to be sent
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_I2C_Master_Receive_IT_withPEC(I2C_HandleTypeDef *hi2c,
		uint16_t DevAddress, uint8_t *pData, uint16_t Size)
{
	if (hi2c->State == HAL_I2C_STATE_READY)
	{
		if ((pData == NULL) || (Size == 0))
		{
			return HAL_ERROR;
		}

		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) == SET)
		{
			return HAL_BUSY;
		}

		/* Process Locked */
		__HAL_LOCK(hi2c);

		hi2c->State = HAL_I2C_STATE_BUSY_RX;
		hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

		hi2c->pBuffPtr = pData;
		hi2c->XferSize = Size;
		hi2c->XferCount = Size;

		/* Send Slave Address */
		if (I2C_MasterRequestRead(hi2c, DevAddress, I2C_TIMEOUT_FLAG) != HAL_OK)
		{
			if (hi2c->ErrorCode == HAL_I2C_ERROR_AF)
			{
				/* Process Unlocked */
				__HAL_UNLOCK(hi2c);
				return HAL_ERROR;
			}
			else
			{
				/* Process Unlocked */
				__HAL_UNLOCK(hi2c);
				return HAL_TIMEOUT;
			}
		}

		if (hi2c->XferCount == 1 && !I2C_CHECK_PEC(hi2c))
		{
			/* Disable Acknowledge */
			hi2c->Instance->CR1 &= ~I2C_CR1_ACK;

			/* Clear ADDR flag */
			__HAL_I2C_CLEAR_ADDRFLAG(hi2c);

			if (!I2C_CHECK_PEC(hi2c))
			{
				/* Generate Stop */
				hi2c->Instance->CR1 |= I2C_CR1_STOP;
			}
		}
		else if (hi2c->XferCount == 2 || (Size == 1 && I2C_CHECK_PEC(hi2c)))
		{
			/* Disable Acknowledge */
			hi2c->Instance->CR1 &= ~I2C_CR1_ACK;

			/* Enable Pos */
			hi2c->Instance->CR1 |= I2C_CR1_POS;

			/* Clear ADDR flag */
			__HAL_I2C_CLEAR_ADDRFLAG(hi2c);
		}
		else
		{
			/* Enable Acknowledge */
			hi2c->Instance->CR1 |= I2C_CR1_ACK;

			/* Clear ADDR flag */
			__HAL_I2C_CLEAR_ADDRFLAG(hi2c);
		}

		/* Process Unlocked */
		__HAL_UNLOCK(hi2c);

		/* Note : The I2C interrupts must be enabled after unlocking current process
		 to avoid the risk of I2C interrupt handle execution before current
		 process unlock */

		/* Enable EVT, BUF and ERR interrupt */
		__HAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}

/**
 * @brief  Transmit in slave mode an amount of data in no-blocking mode with Interrupt
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @param  pData: Pointer to data buffer
 * @param  Size: Amount of data to be sent
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_I2C_Slave_Transmit_IT_withPEC(I2C_HandleTypeDef *hi2c,
		uint8_t *pData, uint16_t Size)
{
	if (hi2c->State == HAL_I2C_STATE_READY)
	{
		if ((pData == NULL) || (Size == 0))
		{
			return HAL_ERROR;
		}

		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) == SET)
		{
			return HAL_BUSY;
		}

		/* Process Locked */
		__HAL_LOCK(hi2c);

		hi2c->State = HAL_I2C_STATE_BUSY_TX;
		hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

		hi2c->pBuffPtr = pData;
		hi2c->XferSize = Size;
		hi2c->XferCount = Size;

		/* Enable Address Acknowledge */
		hi2c->Instance->CR1 |= I2C_CR1_ACK;

		/* Process Unlocked */
		__HAL_UNLOCK(hi2c);

		/* Note : The I2C interrupts must be enabled after unlocking current process
		 to avoid the risk of I2C interrupt handle execution before current
		 process unlock */

		/* Enable EVT, BUF and ERR interrupt */
		__HAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}

/**
 * @brief  Receive in slave mode an amount of data in no-blocking mode with Interrupt
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @param  pData: Pointer to data buffer
 * @param  Size: Amount of data to be sent
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_I2C_Slave_Receive_IT_withPEC(I2C_HandleTypeDef *hi2c,
		uint8_t *pData, uint16_t Size)
{
	if (hi2c->State == HAL_I2C_STATE_READY)
	{
		if ((pData == NULL) || (Size == 0))
		{
			return HAL_ERROR;
		}

		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) == SET)
		{
			return HAL_BUSY;
		}

		/* Process Locked */
		__HAL_LOCK(hi2c);

		hi2c->State = HAL_I2C_STATE_BUSY_RX;
		hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

		hi2c->pBuffPtr = pData;
		hi2c->XferSize = Size;
		hi2c->XferCount = Size;

		/* Enable Address Acknowledge */
		hi2c->Instance->CR1 |= I2C_CR1_ACK;

		/* Process Unlocked */
		__HAL_UNLOCK(hi2c);

		/* Note : The I2C interrupts must be enabled after unlocking current process
		 to avoid the risk of I2C interrupt handle execution before current
		 process unlock */

		/* Enable EVT, BUF and ERR interrupt */
		__HAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}

///**
// * @brief  Transmit in master mode an amount of data in no-blocking mode with DMA
// * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
// *         the configuration information for I2C module
// * @param  DevAddress: Target device address
// * @param  pData: Pointer to data buffer
// * @param  Size: Amount of data to be sent
// * @retval HAL status
// */
//HAL_StatusTypeDef HAL_I2C_Master_Transmit_DMA(I2C_HandleTypeDef *hi2c,
//		uint16_t DevAddress, uint8_t *pData, uint16_t Size)
//{
//	if (hi2c->State == HAL_I2C_STATE_READY)
//	{
//		if ((pData == NULL) || (Size == 0))
//		{
//			return HAL_ERROR;
//		}
//
//		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) == SET)
//		{
//			return HAL_BUSY;
//		}
//
//		/* Process Locked */
//		__HAL_LOCK(hi2c);
//
//		hi2c->State = HAL_I2C_STATE_BUSY_TX;
//		hi2c->ErrorCode = HAL_I2C_ERROR_NONE;
//
//		hi2c->pBuffPtr = pData;
//		hi2c->XferSize = Size;
//		hi2c->XferCount = Size;
//
//		/* Set the I2C DMA transfer complete callback */
//		hi2c->hdmatx->XferCpltCallback = I2C_DMAMasterTransmitCplt;
//
//		/* Set the DMA error callback */
//		hi2c->hdmatx->XferErrorCallback = I2C_DMAError;
//
//		/* Enable the DMA Stream */
//		HAL_DMA_Start_IT(hi2c->hdmatx, (uint32_t) pData,
//				(uint32_t) &hi2c->Instance->DR, Size);
//
//		/* Send Slave Address */
//		if (I2C_MasterRequestWrite(hi2c, DevAddress, I2C_TIMEOUT_FLAG)
//				!= HAL_OK)
//		{
//			if (hi2c->ErrorCode == HAL_I2C_ERROR_AF)
//			{
//				/* Process Unlocked */
//				__HAL_UNLOCK(hi2c);
//				return HAL_ERROR;
//			}
//			else
//			{
//				/* Process Unlocked */
//				__HAL_UNLOCK(hi2c);
//				return HAL_TIMEOUT;
//			}
//		}
//
//		/* Enable DMA Request */
//		hi2c->Instance->CR2 |= I2C_CR2_DMAEN;
//
//		/* Clear ADDR flag */
//		__HAL_I2C_CLEAR_ADDRFLAG(hi2c);
//
//		/* Process Unlocked */
//		__HAL_UNLOCK(hi2c);
//
//		return HAL_OK;
//	}
//	else
//	{
//		return HAL_BUSY;
//	}
//}

///**
// * @brief  Receive in master mode an amount of data in no-blocking mode with DMA
// * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
// *         the configuration information for I2C module
// * @param  DevAddress: Target device address
// * @param  pData: Pointer to data buffer
// * @param  Size: Amount of data to be sent
// * @retval HAL status
// */
//HAL_StatusTypeDef HAL_I2C_Master_Receive_DMA(I2C_HandleTypeDef *hi2c,
//		uint16_t DevAddress, uint8_t *pData, uint16_t Size)
//{
//	if (hi2c->State == HAL_I2C_STATE_READY)
//	{
//		if ((pData == NULL) || (Size == 0))
//		{
//			return HAL_ERROR;
//		}
//
//		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) == SET)
//		{
//			return HAL_BUSY;
//		}
//
//		/* Process Locked */
//		__HAL_LOCK(hi2c);
//
//		hi2c->State = HAL_I2C_STATE_BUSY_RX;
//		hi2c->ErrorCode = HAL_I2C_ERROR_NONE;
//
//		hi2c->pBuffPtr = pData;
//		hi2c->XferSize = Size;
//		hi2c->XferCount = Size;
//
//		/* Set the I2C DMA transfer complete callback */
//		hi2c->hdmarx->XferCpltCallback = I2C_DMAMasterReceiveCplt;
//
//		/* Set the DMA error callback */
//		hi2c->hdmarx->XferErrorCallback = I2C_DMAError;
//
//		/* Enable the DMA Stream */
//		HAL_DMA_Start_IT(hi2c->hdmarx, (uint32_t) &hi2c->Instance->DR,
//				(uint32_t) pData, Size);
//
//		/* Send Slave Address */
//		if (I2C_MasterRequestRead(hi2c, DevAddress, I2C_TIMEOUT_FLAG) != HAL_OK)
//		{
//			if (hi2c->ErrorCode == HAL_I2C_ERROR_AF)
//			{
//				/* Process Unlocked */
//				__HAL_UNLOCK(hi2c);
//				return HAL_ERROR;
//			}
//			else
//			{
//				/* Process Unlocked */
//				__HAL_UNLOCK(hi2c);
//				return HAL_TIMEOUT;
//			}
//		}
//
//		if (Size == 1)
//		{
//			/* Disable Acknowledge */
//			hi2c->Instance->CR1 &= ~I2C_CR1_ACK;
//		}
//		else
//		{
//			/* Enable Last DMA bit */
//			hi2c->Instance->CR2 |= I2C_CR2_LAST;
//		}
//
//		/* Enable DMA Request */
//		hi2c->Instance->CR2 |= I2C_CR2_DMAEN;
//
//		/* Clear ADDR flag */
//		__HAL_I2C_CLEAR_ADDRFLAG(hi2c);
//
//		/* Process Unlocked */
//		__HAL_UNLOCK(hi2c);
//
//		return HAL_OK;
//	}
//	else
//	{
//		return HAL_BUSY;
//	}
//}
//
///**
// * @brief  Transmit in slave mode an amount of data in no-blocking mode with DMA
// * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
// *         the configuration information for I2C module
// * @param  pData: Pointer to data buffer
// * @param  Size: Amount of data to be sent
// * @retval HAL status
// */
//HAL_StatusTypeDef HAL_I2C_Slave_Transmit_DMA(I2C_HandleTypeDef *hi2c,
//		uint8_t *pData, uint16_t Size)
//{
//	if (hi2c->State == HAL_I2C_STATE_READY)
//	{
//		if ((pData == NULL) || (Size == 0))
//		{
//			return HAL_ERROR;
//		}
//
//		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) == SET)
//		{
//			return HAL_BUSY;
//		}
//
//		/* Process Locked */
//		__HAL_LOCK(hi2c);
//
//		hi2c->State = HAL_I2C_STATE_BUSY_TX;
//		hi2c->ErrorCode = HAL_I2C_ERROR_NONE;
//
//		hi2c->pBuffPtr = pData;
//		hi2c->XferSize = Size;
//		hi2c->XferCount = Size;
//
//		/* Set the I2C DMA transfer complete callback */
//		hi2c->hdmatx->XferCpltCallback = I2C_DMASlaveTransmitCplt;
//
//		/* Set the DMA error callback */
//		hi2c->hdmatx->XferErrorCallback = I2C_DMAError;
//
//		/* Enable the DMA Stream */
//		HAL_DMA_Start_IT(hi2c->hdmatx, (uint32_t) pData,
//				(uint32_t) &hi2c->Instance->DR, Size);
//
//		/* Enable DMA Request */
//		hi2c->Instance->CR2 |= I2C_CR2_DMAEN;
//
//		/* Enable Address Acknowledge */
//		hi2c->Instance->CR1 |= I2C_CR1_ACK;
//
//		/* Wait until ADDR flag is set */
//		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, RESET,
//		I2C_TIMEOUT_ADDR_SLAVE) != HAL_OK)
//		{
//			return HAL_TIMEOUT;
//		}
//
//		/* If 7bit addressing mode is selected */
//		if (hi2c->Init.AddressingMode == I2C_ADDRESSINGMODE_7BIT)
//		{
//			/* Clear ADDR flag */
//			__HAL_I2C_CLEAR_ADDRFLAG(hi2c);
//		}
//		else
//		{
//			/* Clear ADDR flag */
//			__HAL_I2C_CLEAR_ADDRFLAG(hi2c);
//
//			/* Wait until ADDR flag is set */
//			if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, RESET,
//			I2C_TIMEOUT_ADDR_SLAVE) != HAL_OK)
//			{
//				return HAL_TIMEOUT;
//			}
//
//			/* Clear ADDR flag */
//			__HAL_I2C_CLEAR_ADDRFLAG(hi2c);
//		}
//
//		/* Process Unlocked */
//		__HAL_UNLOCK(hi2c);
//
//		return HAL_OK;
//	}
//	else
//	{
//		return HAL_BUSY;
//	}
//}
//
///**
// * @brief  Receive in slave mode an amount of data in no-blocking mode with DMA
// * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
// *         the configuration information for I2C module
// * @param  pData: Pointer to data buffer
// * @param  Size: Amount of data to be sent
// * @retval HAL status
// */
//HAL_StatusTypeDef HAL_I2C_Slave_Receive_DMA(I2C_HandleTypeDef *hi2c,
//		uint8_t *pData, uint16_t Size)
//{
//	if (hi2c->State == HAL_I2C_STATE_READY)
//	{
//		if ((pData == NULL) || (Size == 0))
//		{
//			return HAL_ERROR;
//		}
//
//		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) == SET)
//		{
//			return HAL_BUSY;
//		}
//
//		/* Process Locked */
//		__HAL_LOCK(hi2c);
//
//		hi2c->State = HAL_I2C_STATE_BUSY_RX;
//		hi2c->ErrorCode = HAL_I2C_ERROR_NONE;
//
//		hi2c->pBuffPtr = pData;
//		hi2c->XferSize = Size;
//		hi2c->XferCount = Size;
//
//		/* Set the I2C DMA transfer complete callback */
//		hi2c->hdmarx->XferCpltCallback = I2C_DMASlaveReceiveCplt;
//
//		/* Set the DMA error callback */
//		hi2c->hdmarx->XferErrorCallback = I2C_DMAError;
//
//		/* Enable the DMA Stream */
//		HAL_DMA_Start_IT(hi2c->hdmarx, (uint32_t) &hi2c->Instance->DR,
//				(uint32_t) pData, Size);
//
//		/* Enable DMA Request */
//		hi2c->Instance->CR2 |= I2C_CR2_DMAEN;
//
//		/* Enable Address Acknowledge */
//		hi2c->Instance->CR1 |= I2C_CR1_ACK;
//
//		/* Wait until ADDR flag is set */
//		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, RESET,
//		I2C_TIMEOUT_ADDR_SLAVE) != HAL_OK)
//		{
//			return HAL_TIMEOUT;
//		}
//
//		/* Clear ADDR flag */
//		__HAL_I2C_CLEAR_ADDRFLAG(hi2c);
//
//		/* Process Unlocked */
//		__HAL_UNLOCK(hi2c);
//
//		return HAL_OK;
//	}
//	else
//	{
//		return HAL_BUSY;
//	}
//}

