ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper_hal.c
/* New Functions *********************************************************************/
/**
 * @brief  Receive in slave mode an amount of data in no-blocking mode with DMA, avoiding
 * 		   the reception of the address in polled mode.
 * 		   REQUIRE enabled interrupt.
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @param  pData: Pointer to data buffer
 * @param  Size: Amount of data to be sent
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_I2C_Slave_Receive_DMA_IT(I2C_HandleTypeDef *hi2c,
		uint8_t *pData, uint16_t Size)
{
	if (hi2c->State == HAL_I2C_STATE_READY)
	{
		if ((pData == NULL) || (Size == 0))
		{
			return HAL_ERROR;
		}

		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BUSY) == SET)
		{
			return HAL_BUSY;
		}

		/* Process Locked */
		__HAL_LOCK(hi2c);

		hi2c->State = HAL_I2C_STATE_BUSY_RX;
		hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

		hi2c->pBuffPtr = pData;
		hi2c->XferSize = Size;
		hi2c->XferCount = Size;

//		/* Set the I2C DMA transfer complete callback */
//		hi2c->hdmarx->XferCpltCallback = I2C_DMASlaveReceiveCplt;
//
//		/* Set the DMA error callback */
//		hi2c->hdmarx->XferErrorCallback = I2C_DMAError;
//
//		/* Enable the DMA Stream */
//		HAL_DMA_Start_IT(hi2c->hdmarx, (uint32_t) &hi2c->Instance->DR,
//				(uint32_t) pData, Size);
//
//		/* Enable DMA Request */
//		hi2c->Instance->CR2 |= I2C_CR2_DMAEN;

		/* Enable Address Acknowledge */
		hi2c->Instance->CR1 |= I2C_CR1_ACK;

//		/* Wait until ADDR flag is set */
//		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, RESET,
//		I2C_TIMEOUT_ADDR_SLAVE) != HAL_OK) {
//			return HAL_TIMEOUT;
//		}
//
//		/* Clear ADDR flag */
//		__HAL_I2C_CLEAR_ADDRFLAG(hi2c);

		/* Set the dmaUsed flag */
		setDmaUsed(hi2c, 0x01);

		/* Process Unlocked */
		__HAL_UNLOCK(hi2c);

		/* Note : The I2C interrupts must be enabled after unlocking current process
		 to avoid the risk of I2C interrupt handle execution before current
		 process unlock */

		/* Enable EVT, BUF and ERR interrupt */
		__HAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}
/*************************************************************************************/
/**
 * @brief  This function handles I2C event interrupt request.
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @retval HAL status
 */
void I2C_HELPER_EV_IRQHandler(I2C_HandleTypeDef *hi2c)
{
	uint32_t tmp1 = 0, tmp2 = 0, tmp3 = 0, tmp4 = 0;
	/* Master mode selected */
	if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_MSL) == SET)
	{
		/* I2C in mode Transmitter -----------------------------------------------*/
		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TRA) == SET)
		{
			tmp1 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TXE);
			tmp2 = __HAL_I2C_GET_IT_SOURCE(hi2c, I2C_IT_BUF);
			tmp3 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BTF);
			tmp4 = __HAL_I2C_GET_IT_SOURCE(hi2c, I2C_IT_EVT);
			/* TXE set and BTF reset -----------------------------------------------*/
			if ((tmp1 == SET) && (tmp2 == SET) && (tmp3 == RESET))
			{
				I2C_MasterTransmit_TXE(hi2c);
			}
			/* BTF set -------------------------------------------------------------*/
			else if ((tmp3 == SET) && (tmp4 == SET))
			{
				I2C_MasterTransmit_BTF(hi2c);
			}
		}
		/* I2C in mode Receiver --------------------------------------------------*/
		else
		{
			tmp1 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_RXNE);
			tmp2 = __HAL_I2C_GET_IT_SOURCE(hi2c, I2C_IT_BUF);
			tmp3 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BTF);
			tmp4 = __HAL_I2C_GET_IT_SOURCE(hi2c, I2C_IT_EVT);
			/* RXNE set and BTF reset -----------------------------------------------*/
			if ((tmp1 == SET) && (tmp2 == SET) && (tmp3 == RESET))
			{
				I2C_MasterReceive_RXNE(hi2c);
			}
			/* BTF set -------------------------------------------------------------*/
			else if ((tmp3 == SET) && (tmp4 == SET))
			{
				I2C_MasterReceive_BTF(hi2c);
			}
		}
	}
	/* Slave mode selected */
	else
	{
		tmp1 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_ADDR);
		tmp2 = __HAL_I2C_GET_IT_SOURCE(hi2c, (I2C_IT_EVT));
		tmp3 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_STOPF);
		tmp4 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TRA);
		/* ADDR set --------------------------------------------------------------*/
		if ((tmp1 == SET) && (tmp2 == SET))
		{
			I2C_Slave_ADDR(hi2c);
		}
		/* STOPF set --------------------------------------------------------------*/
		else if ((tmp3 == SET) && (tmp2 == SET))
		{
			I2C_Slave_STOPF(hi2c);
		}
		/* I2C in mode Transmitter -----------------------------------------------*/
		else if (tmp4 == SET)
		{
			tmp1 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TXE);
			tmp2 = __HAL_I2C_GET_IT_SOURCE(hi2c, I2C_IT_BUF);
			tmp3 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BTF);
			tmp4 = __HAL_I2C_GET_IT_SOURCE(hi2c, I2C_IT_EVT);
			/* TXE set and BTF reset -----------------------------------------------*/
			if ((tmp1 == SET) && (tmp2 == SET) && (tmp3 == RESET))
			{
				I2C_SlaveTransmit_TXE(hi2c);
			}
			/* BTF set -------------------------------------------------------------*/
			else if ((tmp3 == SET) && (tmp4 == SET))
			{
				I2C_SlaveTransmit_BTF(hi2c);
			}
		}
		/* I2C in mode Receiver --------------------------------------------------*/
		else
		{
			tmp1 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_RXNE);
			tmp2 = __HAL_I2C_GET_IT_SOURCE(hi2c, I2C_IT_BUF);
			tmp3 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BTF);
			tmp4 = __HAL_I2C_GET_IT_SOURCE(hi2c, I2C_IT_EVT);
			/* RXNE set and BTF reset ----------------------------------------------*/
			if ((tmp1 == SET) && (tmp2 == SET) && (tmp3 == RESET))
			{
				I2C_SlaveReceive_RXNE(hi2c);
			}
			/* BTF set -------------------------------------------------------------*/
			else if ((tmp3 == SET) && (tmp4 == SET))
			{
				I2C_SlaveReceive_BTF(hi2c);
			}
		}
	}
}

/**
 * @brief  This function handles I2C error interrupt request.
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @retval HAL status
 */
void I2C_HELPER_ER_IRQHandler(I2C_HandleTypeDef *hi2c)
{
	uint32_t tmp1 = 0, tmp2 = 0, tmp3 = 0;

