ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper_hal.c
	tmp1 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_BERR);
	tmp2 = __HAL_I2C_GET_IT_SOURCE(hi2c, I2C_IT_ERR);
	/* I2C Bus error interrupt occurred ----------------------------------------*/
	if ((tmp1 == SET) && (tmp2 == SET))
	{
		hi2c->ErrorCode |= HAL_I2C_ERROR_BERR;

		/* Clear BERR flag */
		__HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_BERR);
	}

	tmp1 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_ARLO);
	tmp2 = __HAL_I2C_GET_IT_SOURCE(hi2c, I2C_IT_ERR);
	/* I2C Arbitration Loss error interrupt occurred ---------------------------*/
	if ((tmp1 == SET) && (tmp2 == SET))
	{
		hi2c->ErrorCode |= HAL_I2C_ERROR_ARLO;

		/* Clear ARLO flag */
		__HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_ARLO);
	}

	tmp1 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_AF);
	tmp2 = __HAL_I2C_GET_IT_SOURCE(hi2c, I2C_IT_ERR);
	/* I2C Acknowledge failure error interrupt occurred ------------------------*/
	if ((tmp1 == SET) && (tmp2 == SET))
	{
		tmp1 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_MSL);
		tmp2 = hi2c->XferCount;
		tmp3 = hi2c->State;
		if ((tmp1 == RESET) && (tmp2 == 0) && (tmp3 == HAL_I2C_STATE_BUSY_TX))
		{
			I2C_Slave_AF(hi2c);
		}
		else
		{
			hi2c->ErrorCode |= HAL_I2C_ERROR_AF;
			/* Clear AF flag */
			__HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);
		}
	}

	tmp1 = __HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_OVR);
	tmp2 = __HAL_I2C_GET_IT_SOURCE(hi2c, I2C_IT_ERR);
	/* I2C Over-Run/Under-Run interrupt occurred -------------------------------*/
	if ((tmp1 == SET) && (tmp2 == SET))
	{
		hi2c->ErrorCode |= HAL_I2C_ERROR_OVR;
		/* Clear OVR flag */
		__HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_OVR);
	}

	if (hi2c->ErrorCode != HAL_I2C_ERROR_NONE)
	{
		hi2c->State = HAL_I2C_STATE_READY;

		/* Disable Pos bit in I2C CR1 when error occurred in Master/Mem Receive IT Process */
		hi2c->Instance->CR1 &= ~I2C_CR1_POS;

		HAL_I2C_ErrorCallback(hi2c);
	}
}

/** @defgroup I2C_Exported_Functions_Group3 Peripheral State and Errors functions
 *  @brief   Peripheral State and Errors functions
 *
 @verbatim
 ===============================================================================
 ##### Peripheral State and Errors functions #####
 ===============================================================================
 [..]
 This subsection permits to get in run-time the status of the peripheral
 and the data flow.

 @endverbatim
*/

 /**
 * @brief  Handle TXE flag for Master
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_MasterTransmit_TXE(I2C_HandleTypeDef *hi2c)
{
	/* Write data to DR */
	hi2c->Instance->DR = (*hi2c->pBuffPtr++);
	hi2c->XferCount--;

	if (hi2c->XferCount == 0)
	{
		/* Disable BUF interrupt */
		__HAL_I2C_DISABLE_IT(hi2c, I2C_IT_BUF);
	}

	return HAL_OK;
}

/**
 * @brief  Handle BTF flag for Master transmitter
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_MasterTransmit_BTF(I2C_HandleTypeDef *hi2c)
{
	if (hi2c->XferCount != 0)
	{
		/* Write data to DR */
		hi2c->Instance->DR = (*hi2c->pBuffPtr++);
		hi2c->XferCount--;
	}
	else
	{

		/************ PEC CODE **********************/
		if (I2C_CHECK_PEC(hi2c))
		{
			/* Write PEC bit and send PEC Byte */
			hi2c->Instance->CR1 |= I2C_CR1_PEC;
		}
		/*******************************************/

		/* Disable EVT, BUF and ERR interrupt */
		__HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

		/* Generate Stop */
		hi2c->Instance->CR1 |= I2C_CR1_STOP;

		/* Wait until BUSY flag is reset */
		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET,
		I2C_TIMEOUT_FLAG) != HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		if (hi2c->State == HAL_I2C_STATE_MEM_BUSY_TX)
		{
			hi2c->State = HAL_I2C_STATE_READY;

			HAL_I2C_MemTxCpltCallback(hi2c);
		}
		else
		{
			hi2c->State = HAL_I2C_STATE_READY;

			HAL_I2C_MasterTxCpltCallback(hi2c);
		}
	}
	return HAL_OK;
}

// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wconversion"
#endif

/**
 * @brief  Handle RXNE flag for Master
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_MasterReceive_RXNE(I2C_HandleTypeDef *hi2c)
{
	uint32_t tmp = 0;

	tmp = hi2c->XferCount;
	if (tmp > 3)
	{
		/* Read data from DR */
		(*hi2c->pBuffPtr++) = hi2c->Instance->DR;
		hi2c->XferCount--;
	}
	else if ((tmp == 2) || (tmp == 3))
	{
		/* Disable BUF interrupt */
		__HAL_I2C_DISABLE_IT(hi2c, I2C_IT_BUF);
	}
	else
	{
		/* Disable EVT, BUF and ERR interrupt */
		__HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

		/* Read data from DR */
		(*hi2c->pBuffPtr++) = hi2c->Instance->DR;
		hi2c->XferCount--;

		/********************* PEC CODE *****************************************/
		if (I2C_CHECK_PEC(hi2c) && hi2c->XferCount == 0)
		{
			/* Disable Acknowledge */
			hi2c->Instance->CR1 &= ~I2C_CR1_ACK;

			/* Write PEC bit and receive PEC Byte */
			hi2c->Instance->CR1 |= I2C_CR1_PEC;

			/* The master waits until RXNE flag is set, it means data register is NOT empty. */
			/* RxNE Event */
			if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_RXNE, RESET,
			I2C_TIMEOUT_FLAG) != HAL_OK)
			{
				return HAL_TIMEOUT;
			}

			/* Generate Stop */
			hi2c->Instance->CR1 |= I2C_CR1_STOP;

			/* Read PEC Byte */
			*hi2c->pBuffPtr = hi2c->Instance->DR;
		}
		/***********************************************************************/

		/* Wait until BUSY flag is reset */
		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET,
		I2C_TIMEOUT_FLAG) != HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* Disable Pos */
		hi2c->Instance->CR1 &= ~I2C_CR1_POS;

