ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper_hal.c
		if (hi2c->State == HAL_I2C_STATE_MEM_BUSY_RX)
		{
			hi2c->State = HAL_I2C_STATE_READY;

			HAL_I2C_MemRxCpltCallback(hi2c);
		}
		else
		{
			hi2c->State = HAL_I2C_STATE_READY;

			HAL_I2C_MasterRxCpltCallback(hi2c);
		}
	}
	return HAL_OK;
}

/**
 * @brief  Handle BTF flag for Master receiver
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_MasterReceive_BTF(I2C_HandleTypeDef *hi2c)
{
	if (hi2c->XferCount == 3)
	{
		/* Disable Acknowledge, only if there isn't PECMODE */
		hi2c->Instance->CR1 &=
				!I2C_CHECK_PEC(hi2c) ? ~I2C_CR1_ACK : (uint32_t) 0xFFFFFFFF;

		/* Read data from DR */
		(*hi2c->pBuffPtr++) = hi2c->Instance->DR;
		hi2c->XferCount--;
	}
	else if (hi2c->XferCount == 2)
	{
		/* Generate Stop, only if there isn't PECMODE */
		hi2c->Instance->CR1 |= !I2C_CHECK_PEC(hi2c) ?
		I2C_CR1_STOP :
														(uint32_t) 0x00000000;

		/* Read data from DR */
		(*hi2c->pBuffPtr++) = hi2c->Instance->DR;
		hi2c->XferCount--;

		/* Read data from DR */
		(*hi2c->pBuffPtr++) = hi2c->Instance->DR;
		hi2c->XferCount--;

		/* Disable EVT and ERR interrupt */
		__HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);

		/********************* PEC CODE *****************************************/
		if (I2C_CHECK_PEC(hi2c) && hi2c->XferCount == 0)
		{
			/* Disable Acknowledge */
			hi2c->Instance->CR1 &= ~I2C_CR1_ACK;

			/* Write PEC bit and receive PEC Byte */
			hi2c->Instance->CR1 |= I2C_CR1_PEC;

			/* The master waits until RXNE flag is set, it means data register is NOT empty. */
			/* RxNE Event */
			if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_RXNE, RESET,
			I2C_TIMEOUT_FLAG) != HAL_OK)
			{
				return HAL_TIMEOUT;
			}
			/* Generate Stop */
			hi2c->Instance->CR1 |= I2C_CR1_STOP;

			/* Read PEC Byte */
			*hi2c->pBuffPtr = hi2c->Instance->DR;

		}
		/***********************************************************************/

		/* Wait until BUSY flag is reset */
		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET,
		I2C_TIMEOUT_FLAG) != HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* Disable Pos */
		hi2c->Instance->CR1 &= ~I2C_CR1_POS;

		if (hi2c->State == HAL_I2C_STATE_MEM_BUSY_RX)
		{
			hi2c->State = HAL_I2C_STATE_READY;

			HAL_I2C_MemRxCpltCallback(hi2c);
		}
		else
		{
			hi2c->State = HAL_I2C_STATE_READY;

			HAL_I2C_MasterRxCpltCallback(hi2c);
		}
	}
	else
	{
		/* Read data from DR */
		(*hi2c->pBuffPtr++) = hi2c->Instance->DR;
		hi2c->XferCount--;
	}
	return HAL_OK;
}

/**
 * @brief  Handle TXE flag for Slave
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_SlaveTransmit_TXE(I2C_HandleTypeDef *hi2c)
{
	if (hi2c->XferCount != 0)
	{
		/* Write data to DR */
		hi2c->Instance->DR = (*hi2c->pBuffPtr++);
		hi2c->XferCount--;
	}
	else
	{
		/************ PEC CODE **********************/
		/* Last byte transmitted */
		if (I2C_CHECK_PEC(hi2c))
		{
			/* Write PEC bit, transmit the PEC Byte */
			hi2c->Instance->CR1 |= I2C_CR1_PEC;
		}
		/*******************************************/
	}
	return HAL_OK;
}

/**
 * @brief  Handle BTF flag for Slave transmitter
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_SlaveTransmit_BTF(I2C_HandleTypeDef *hi2c)
{
	if (hi2c->XferCount != 0)
	{
		/* Write data to DR */
		hi2c->Instance->DR = (*hi2c->pBuffPtr++);
		hi2c->XferCount--;
	}
	else
	{
		/************ PEC CODE **********************/
		/* Last byte transmitted */
		if (I2C_CHECK_PEC(hi2c))
		{
			/* Write PEC bit, transmit the PEC Byte */
			hi2c->Instance->CR1 |= I2C_CR1_PEC;
		}
		/*******************************************/
	}
	return HAL_OK;
}

/**
 * @brief  Handle RXNE flag for Slave
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_SlaveReceive_RXNE(I2C_HandleTypeDef *hi2c)
{
	if (hi2c->XferCount != 0)
	{
		/* Read data from DR */
		(*hi2c->pBuffPtr++) = hi2c->Instance->DR;
		hi2c->XferCount--;

		/************ PEC CODE **********************/
		/* Last byte received */
		if (I2C_CHECK_PEC(hi2c) && hi2c->XferCount == 0)
		{
			/* Write PEC bit, receive and check the PEC Byte */
			hi2c->Instance->CR1 |= I2C_CR1_PEC;
		}
		/*******************************************/
	}
	return HAL_OK;
}

/**
 * @brief  Handle BTF flag for Slave receiver
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_SlaveReceive_BTF(I2C_HandleTypeDef *hi2c)
{
	if (hi2c->XferCount != 0)
	{
		/* Read data from DR */
		(*hi2c->pBuffPtr++) = hi2c->Instance->DR;
		hi2c->XferCount--;

		/************ PEC CODE **********************/
		/* Last byte received */
		if (I2C_CHECK_PEC(hi2c) && hi2c->XferCount == 0)
		{
			/* Write PEC bit, receive and check the PEC Byte */
			hi2c->Instance->CR1 |= I2C_CR1_PEC;
		}
		/*******************************************/
	}
	return HAL_OK;
}

// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic pop
#endif

/**
 * @brief  Handle ADD flag for Slave
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_Slave_ADDR(I2C_HandleTypeDef *hi2c)
{
	/* DMA_IT Code ***********************************************/
	/* Configure the DMA */
	if (getDmaUsed(hi2c) == 0x01)
	{
		/* Disable EVT, BUF and ERR interrupt */
		__HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

		/* Set the I2C DMA transfer complete callback */
		hi2c->hdmarx->XferCpltCallback = I2C_DMA_ITSlaveReceiveCplt;

		/* Set the DMA error callback */
		hi2c->hdmarx->XferErrorCallback = I2C_DMAError;

		/* Enable the DMA Stream */
		HAL_DMA_Start_IT(hi2c->hdmarx, (uint32_t) &hi2c->Instance->DR,
				(uint32_t) hi2c->pBuffPtr, hi2c->XferSize);

		/* Enable DMA Request */
		hi2c->Instance->CR2 |= I2C_CR2_DMAEN;

