ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper_hal.c
		/* Clear dmaUsed Flag */
		setDmaUsed(hi2c, 0x00);
	}
	/*************************************************************/
	/* Clear ADDR flag */
	__HAL_I2C_CLEAR_ADDRFLAG(hi2c);

	return HAL_OK;
}

/**
 * @brief  Handle STOPF flag for Slave
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_Slave_STOPF(I2C_HandleTypeDef *hi2c)
{
	/* DMA_IT Code ***********************************************/
	if (getDmaUsed(hi2c) == 0x01)
	{
		setDmaUsed(hi2c, 0x00);
	}
	else
	{
		/************ PEC CODE **********************/
		if (I2C_CHECK_PEC(hi2c))
		{
			/* Read PEC Byte */
			*hi2c->pBuffPtr = hi2c->Instance->DR;
		}
		/*******************************************/
	}
	/*************************************************************/

	/* Disable EVT, BUF and ERR interrupt */
	__HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

	/* Clear STOPF flag */
	__HAL_I2C_CLEAR_STOPFLAG(hi2c);

	/* Disable Acknowledge */
	hi2c->Instance->CR1 &= ~I2C_CR1_ACK;

	/* Wait until BUSY flag is reset */
	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_FLAG)
			!= HAL_OK)
	{
		return HAL_TIMEOUT;
	}

	hi2c->State = HAL_I2C_STATE_READY;

	HAL_I2C_SlaveRxCpltCallback(hi2c);

	return HAL_OK;
}

/**
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_Slave_AF(I2C_HandleTypeDef *hi2c)
{
	/* Disable EVT, BUF and ERR interrupt */
	__HAL_I2C_DISABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);

	/* Clear AF flag */
	__HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

	/* Disable Acknowledge */
	hi2c->Instance->CR1 &= ~I2C_CR1_ACK;

	/* Wait until BUSY flag is reset */
	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_FLAG)
			!= HAL_OK)
	{
		return HAL_TIMEOUT;
	}

	hi2c->State = HAL_I2C_STATE_READY;

	HAL_I2C_SlaveTxCpltCallback(hi2c);

	return HAL_OK;
}

/**
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @param  DevAddress: Target device address
 * @param  Timeout: Timeout duration
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_MasterRequestWrite(I2C_HandleTypeDef *hi2c,
		uint16_t DevAddress, uint32_t Timeout)
{
	/* Generate Start */
	hi2c->Instance->CR1 |= I2C_CR1_START;

	/* Wait until SB flag is set */
	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_SB, RESET, Timeout) != HAL_OK)
	{
		return HAL_TIMEOUT;
	}

	if (hi2c->Init.AddressingMode == I2C_ADDRESSINGMODE_7BIT)
	{
		/* Send slave address */
		hi2c->Instance->DR = I2C_7BIT_ADD_WRITE(DevAddress);
	}
	else
	{
		/* Send header of slave address */
		hi2c->Instance->DR = I2C_10BIT_HEADER_WRITE(DevAddress);

		/* Wait until ADD10 flag is set */
		if (I2C_WaitOnMasterAddressFlagUntilTimeout(hi2c, I2C_FLAG_ADD10,
				Timeout) != HAL_OK)
		{
			if (hi2c->ErrorCode == HAL_I2C_ERROR_AF)
			{
				return HAL_ERROR;
			}
			else
			{
				return HAL_TIMEOUT;
			}
		}

		/* Send slave address */
		hi2c->Instance->DR = I2C_10BIT_ADDRESS(DevAddress);
	}

	/* Wait until ADDR flag is set */
	if (I2C_WaitOnMasterAddressFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, Timeout)
			!= HAL_OK)
	{
		if (hi2c->ErrorCode == HAL_I2C_ERROR_AF)
		{
			return HAL_ERROR;
		}
		else
		{
			return HAL_TIMEOUT;
		}
	}

	return HAL_OK;
}

/**
 * @brief  Master sends target device address for read request.
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @param  DevAddress: Target device address
 * @param  Timeout: Timeout duration
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_MasterRequestRead(I2C_HandleTypeDef *hi2c,
		uint16_t DevAddress, uint32_t Timeout)
{
	/* Enable Acknowledge */
	hi2c->Instance->CR1 |= I2C_CR1_ACK;

	/* Generate Start */
	hi2c->Instance->CR1 |= I2C_CR1_START;

	/* Wait until SB flag is set */
	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_SB, RESET, Timeout) != HAL_OK)
	{
		return HAL_TIMEOUT;
	}

	if (hi2c->Init.AddressingMode == I2C_ADDRESSINGMODE_7BIT)
	{
		/* Send slave address */
		hi2c->Instance->DR = I2C_7BIT_ADD_READ(DevAddress);
	}
	else
	{
		/* Send header of slave address */
		hi2c->Instance->DR = I2C_10BIT_HEADER_WRITE(DevAddress);

		/* Wait until ADD10 flag is set */
		if (I2C_WaitOnMasterAddressFlagUntilTimeout(hi2c, I2C_FLAG_ADD10,
				Timeout) != HAL_OK)
		{
			if (hi2c->ErrorCode == HAL_I2C_ERROR_AF)
			{
				return HAL_ERROR;
			}
			else
			{
				return HAL_TIMEOUT;
			}
		}

		/* Send slave address */
		hi2c->Instance->DR = I2C_10BIT_ADDRESS(DevAddress);

		/* Wait until ADDR flag is set */
		if (I2C_WaitOnMasterAddressFlagUntilTimeout(hi2c, I2C_FLAG_ADDR,
				Timeout) != HAL_OK)
		{
			if (hi2c->ErrorCode == HAL_I2C_ERROR_AF)
			{
				return HAL_ERROR;
			}
			else
			{
				return HAL_TIMEOUT;
			}
		}

		/* Clear ADDR flag */
		__HAL_I2C_CLEAR_ADDRFLAG(hi2c);

		/* Generate Restart */
		hi2c->Instance->CR1 |= I2C_CR1_START;

		/* Wait until SB flag is set */
		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_SB, RESET, Timeout)
				!= HAL_OK)
		{
			return HAL_TIMEOUT;
		}

		/* Send header of slave address */
		hi2c->Instance->DR = I2C_10BIT_HEADER_READ(DevAddress);
	}

	/* Wait until ADDR flag is set */
	if (I2C_WaitOnMasterAddressFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, Timeout)
			!= HAL_OK)
	{
		if (hi2c->ErrorCode == HAL_I2C_ERROR_AF)
		{
			return HAL_ERROR;
		}
		else
		{
			return HAL_TIMEOUT;
		}
	}

	return HAL_OK;
}

///**
// * @brief  Master sends target device address followed by internal memory address for write request.
// * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
// *         the configuration information for I2C module
// * @param  DevAddress: Target device address
// * @param  MemAddress: Internal memory address
// * @param  MemAddSize: Size of internal memory address
// * @param  Timeout: Timeout duration
// * @retval HAL status
// */
//static HAL_StatusTypeDef I2C_RequestMemoryWrite(I2C_HandleTypeDef *hi2c,
//		uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize,
//		uint32_t Timeout)
//{
//	/* Generate Start */
//	hi2c->Instance->CR1 |= I2C_CR1_START;
//
//	/* Wait until SB flag is set */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_SB, RESET, Timeout) != HAL_OK)
//	{
//		return HAL_TIMEOUT;
//	}
//
//	/* Send slave address */
//	hi2c->Instance->DR = I2C_7BIT_ADD_WRITE(DevAddress);
//
//	/* Wait until ADDR flag is set */
//	if (I2C_WaitOnMasterAddressFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, Timeout)
//			!= HAL_OK)
//	{
//		if (hi2c->ErrorCode == HAL_I2C_ERROR_AF)
//		{
//			return HAL_ERROR;
//		}
//		else
//		{
//			return HAL_TIMEOUT;
//		}
//	}
//
//	/* Clear ADDR flag */
//	__HAL_I2C_CLEAR_ADDRFLAG(hi2c);
//
//	/* Wait until TXE flag is set */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_TXE, RESET, Timeout)
//			!= HAL_OK)
//	{
//		return HAL_TIMEOUT;
//	}
//
//	/* If Memory address size is 8Bit */
//	if (MemAddSize == I2C_MEMADD_SIZE_8BIT)
//	{
//		/* Send Memory Address */
//		hi2c->Instance->DR = I2C_MEM_ADD_LSB(MemAddress);
//	}
//	/* If Memory address size is 16Bit */
//	else
//	{
//		/* Send MSB of Memory Address */
//		hi2c->Instance->DR = I2C_MEM_ADD_MSB(MemAddress);
//
//		/* Wait until TXE flag is set */
//		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_TXE, RESET, Timeout)
//				!= HAL_OK)
//		{
//			return HAL_TIMEOUT;
//		}
//
//		/* Send LSB of Memory Address */
//		hi2c->Instance->DR = I2C_MEM_ADD_LSB(MemAddress);
//	}
//
//	return HAL_OK;
//}
//
///**
// * @brief  Master sends target device address followed by internal memory address for read request.
// * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
// *         the configuration information for I2C module
// * @param  DevAddress: Target device address
// * @param  MemAddress: Internal memory address
// * @param  MemAddSize: Size of internal memory address
// * @param  Timeout: Timeout duration
// * @retval HAL status
// */
//static HAL_StatusTypeDef I2C_RequestMemoryRead(I2C_HandleTypeDef *hi2c,
//		uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize,
//		uint32_t Timeout)
//{
//	/* Enable Acknowledge */
//	hi2c->Instance->CR1 |= I2C_CR1_ACK;
//
//	/* Generate Start */
//	hi2c->Instance->CR1 |= I2C_CR1_START;
//
//	/* Wait until SB flag is set */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_SB, RESET, Timeout) != HAL_OK)
//	{
//		return HAL_TIMEOUT;
//	}
//
//	/* Send slave address */
//	hi2c->Instance->DR = I2C_7BIT_ADD_WRITE(DevAddress);
//
//	/* Wait until ADDR flag is set */
//	if (I2C_WaitOnMasterAddressFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, Timeout)
//			!= HAL_OK)
//	{
//		if (hi2c->ErrorCode == HAL_I2C_ERROR_AF)
//		{
//			return HAL_ERROR;
//		}
//		else
//		{
//			return HAL_TIMEOUT;
//		}
//	}
//
//	/* Clear ADDR flag */
//	__HAL_I2C_CLEAR_ADDRFLAG(hi2c);
//
//	/* Wait until TXE flag is set */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_TXE, RESET, Timeout)
//			!= HAL_OK)
//	{
//		return HAL_TIMEOUT;
//	}
//
//	/* If Memory address size is 8Bit */
//	if (MemAddSize == I2C_MEMADD_SIZE_8BIT)
//	{
//		/* Send Memory Address */
//		hi2c->Instance->DR = I2C_MEM_ADD_LSB(MemAddress);
//	}
//	/* If Memory address size is 16Bit */
//	else
//	{
//		/* Send MSB of Memory Address */
//		hi2c->Instance->DR = I2C_MEM_ADD_MSB(MemAddress);
//
//		/* Wait until TXE flag is set */
//		if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_TXE, RESET, Timeout)
//				!= HAL_OK)
//		{
//			return HAL_TIMEOUT;
//		}
//
//		/* Send LSB of Memory Address */
//		hi2c->Instance->DR = I2C_MEM_ADD_LSB(MemAddress);
//	}
//
//	/* Wait until TXE flag is set */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_TXE, RESET, Timeout)
//			!= HAL_OK)
//	{
//		return HAL_TIMEOUT;
//	}
//
//	/* Generate Restart */
//	hi2c->Instance->CR1 |= I2C_CR1_START;
//
//	/* Wait until SB flag is set */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_SB, RESET, Timeout) != HAL_OK)
//	{
//		return HAL_TIMEOUT;
//	}
//
//	/* Send slave address */
//	hi2c->Instance->DR = I2C_7BIT_ADD_READ(DevAddress);
//
//	/* Wait until ADDR flag is set */
//	if (I2C_WaitOnMasterAddressFlagUntilTimeout(hi2c, I2C_FLAG_ADDR, Timeout)
//			!= HAL_OK)
//	{
//		if (hi2c->ErrorCode == HAL_I2C_ERROR_AF)
//		{
//			return HAL_ERROR;
//		}
//		else
//		{
//			return HAL_TIMEOUT;
//		}
//	}
//
//	return HAL_OK;
//}
//
///**
// * @brief  DMA I2C master transmit process complete callback.
// * @param  hdma: DMA handle
// * @retval None
// */
//static void I2C_DMAMasterTransmitCplt(DMA_HandleTypeDef *hdma)
//{
//	I2C_HandleTypeDef* hi2c =
//			(I2C_HandleTypeDef*) ((DMA_HandleTypeDef*) hdma)->Parent;
//
//	/* Wait until BTF flag is reset */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BTF, RESET, I2C_TIMEOUT_FLAG)
//			!= HAL_OK)
//	{
//		hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
//	}
//
//	/* Generate Stop */
//	hi2c->Instance->CR1 |= I2C_CR1_STOP;
//
//	/* Disable DMA Request */
//	hi2c->Instance->CR2 &= ~I2C_CR2_DMAEN;
//
//	hi2c->XferCount = 0;
//
//	/* Wait until BUSY flag is reset */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_FLAG)
//			!= HAL_OK)
//	{
//		hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
//	}
//
//	hi2c->State = HAL_I2C_STATE_READY;
//
//	/* Check if Errors has been detected during transfer */
//	if (hi2c->ErrorCode != HAL_I2C_ERROR_NONE)
//	{
//		HAL_I2C_ErrorCallback(hi2c);
//	}
//	else
//	{
//		HAL_I2C_MasterTxCpltCallback(hi2c);
//	}
//}
//
///**
// * @brief  DMA I2C slave transmit process complete callback.
// * @param  hdma: DMA handle
// * @retval None
// */
//static void I2C_DMASlaveTransmitCplt(DMA_HandleTypeDef *hdma)
//{
//	I2C_HandleTypeDef* hi2c =
//			(I2C_HandleTypeDef*) ((DMA_HandleTypeDef*) hdma)->Parent;
//
//	/* Wait until AF flag is reset */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_AF, RESET, I2C_TIMEOUT_FLAG)
//			!= HAL_OK)
//	{
//		hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
//	}
//
//	/* Clear AF flag */
//	__HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);
//
//	/* Disable Address Acknowledge */
//	hi2c->Instance->CR1 &= ~I2C_CR1_ACK;
//
//	/* Disable DMA Request */
//	hi2c->Instance->CR2 &= ~I2C_CR2_DMAEN;
//
//	hi2c->XferCount = 0;
//
//	/* Wait until BUSY flag is reset */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_FLAG)
//			!= HAL_OK)
//	{
//		hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
//	}
//
//	hi2c->State = HAL_I2C_STATE_READY;
//
//	/* Check if Errors has been detected during transfer */
//	if (hi2c->ErrorCode != HAL_I2C_ERROR_NONE)
//	{
//		HAL_I2C_ErrorCallback(hi2c);
//	}
//	else
//	{
//		HAL_I2C_SlaveTxCpltCallback(hi2c);
//	}
//}
//
///**
// * @brief  DMA I2C master receive process complete callback
// * @param  hdma: DMA handle
// * @retval None
// */
//static void I2C_DMAMasterReceiveCplt(DMA_HandleTypeDef *hdma)
//{
//	I2C_HandleTypeDef* hi2c =
//			(I2C_HandleTypeDef*) ((DMA_HandleTypeDef*) hdma)->Parent;
//
//	/* Generate Stop */
//	hi2c->Instance->CR1 |= I2C_CR1_STOP;
//
//	/* Disable Last DMA */
//	hi2c->Instance->CR2 &= ~I2C_CR2_LAST;
//
//	/* Disable Acknowledge */
//	hi2c->Instance->CR1 &= ~I2C_CR1_ACK;
//
//	/* Disable DMA Request */
//	hi2c->Instance->CR2 &= ~I2C_CR2_DMAEN;
//
//	hi2c->XferCount = 0;
//
//	/* Wait until BUSY flag is reset */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_FLAG)
//			!= HAL_OK)
//	{
//		hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
//	}
//
//	hi2c->State = HAL_I2C_STATE_READY;
//
//	/* Check if Errors has been detected during transfer */
//	if (hi2c->ErrorCode != HAL_I2C_ERROR_NONE)
//	{
//		HAL_I2C_ErrorCallback(hi2c);
//	}
//	else
//	{
//		HAL_I2C_MasterRxCpltCallback(hi2c);
//	}
//}
//
///**
// * @brief  DMA I2C slave receive process complete callback.
// * @param  hdma: DMA handle
// * @retval None
// */
//static void I2C_DMASlaveReceiveCplt(DMA_HandleTypeDef *hdma)
//{
//	I2C_HandleTypeDef* hi2c =
//			(I2C_HandleTypeDef*) ((DMA_HandleTypeDef*) hdma)->Parent;
//
//	/* Wait until STOPF flag is reset */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_STOPF, RESET,
//	I2C_TIMEOUT_FLAG) != HAL_OK)
//	{
//		hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
//	}
//
//	/* Clear STOPF flag */
//	__HAL_I2C_CLEAR_STOPFLAG(hi2c);
//
//	/* Disable Address Acknowledge */
//	hi2c->Instance->CR1 &= ~I2C_CR1_ACK;
//
//	/* Disable DMA Request */
//	hi2c->Instance->CR2 &= ~I2C_CR2_DMAEN;
//
//	hi2c->XferCount = 0;
//
//	/* Wait until BUSY flag is reset */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_FLAG)
//			!= HAL_OK)
//	{
//		hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
//	}
//
//	hi2c->State = HAL_I2C_STATE_READY;
//
//	/* Check if Errors has been detected during transfer */
//	if (hi2c->ErrorCode != HAL_I2C_ERROR_NONE)
//	{
//		HAL_I2C_ErrorCallback(hi2c);
//	}
//	else
//	{
//		HAL_I2C_SlaveRxCpltCallback(hi2c);
//	}
//}

