ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper_hal.c
/* New Functions *********************************************************************/
/**
 * @brief  DMA I2C slave receive process complete callback, without STOPF polled wait.
 * @param  hdma: DMA handle
 * @retval None
 */
static void I2C_DMA_ITSlaveReceiveCplt(DMA_HandleTypeDef *hdma)
{
	I2C_HandleTypeDef* hi2c =
			(I2C_HandleTypeDef*) ((DMA_HandleTypeDef*) hdma)->Parent;

	/* Set DMAUsed */
	setDmaUsed(hi2c, 0x01);

	/* Enable EVT, BUF and ERR interrupt */
	__HAL_I2C_ENABLE_IT(hi2c, I2C_IT_EVT | I2C_IT_ERR);

//	/* Wait until STOPF flag is reset */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_STOPF, RESET,
//	I2C_TIMEOUT_FLAG) != HAL_OK) {
//		hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
//	}
//
//	/* Clear STOPF flag */
//	__HAL_I2C_CLEAR_STOPFLAG(hi2c);

//	/* Disable Address Acknowledge */
//	hi2c->Instance->CR1 &= ~I2C_CR1_ACK;
//
//	/* Disable DMA Request */
//	hi2c->Instance->CR2 &= ~I2C_CR2_DMAEN;
//
//	hi2c->XferCount = 0;
//
//	/* Wait until BUSY flag is reset */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_FLAG)
//			!= HAL_OK) {
//		hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
//	}
//
//	hi2c->State = HAL_I2C_STATE_READY;
//
//	/* Check if Errors has been detected during transfer */
//	if (hi2c->ErrorCode != HAL_I2C_ERROR_NONE) {
//		HAL_I2C_ErrorCallback(hi2c);
//	} else {
//		HAL_I2C_SlaveRxCpltCallback(hi2c);
//	}
}
/*************************************************************************************/

///**
// * @brief  DMA I2C Memory Write process complete callback
// * @param  hdma: DMA handle
// * @retval None
// */
//static void I2C_DMAMemTransmitCplt(DMA_HandleTypeDef *hdma)
//{
//	I2C_HandleTypeDef* hi2c =
//			(I2C_HandleTypeDef*) ((DMA_HandleTypeDef*) hdma)->Parent;
//
//	/* Wait until BTF flag is reset */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BTF, RESET, I2C_TIMEOUT_FLAG)
//			!= HAL_OK)
//	{
//		hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
//	}
//
//	/* Generate Stop */
//	hi2c->Instance->CR1 |= I2C_CR1_STOP;
//
//	/* Disable DMA Request */
//	hi2c->Instance->CR2 &= ~I2C_CR2_DMAEN;
//
//	hi2c->XferCount = 0;
//
//	/* Wait until BUSY flag is reset */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_FLAG)
//			!= HAL_OK)
//	{
//		hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
//	}
//
//	hi2c->State = HAL_I2C_STATE_READY;
//
//	/* Check if Errors has been detected during transfer */
//	if (hi2c->ErrorCode != HAL_I2C_ERROR_NONE)
//	{
//		HAL_I2C_ErrorCallback(hi2c);
//	}
//	else
//	{
//		HAL_I2C_MemTxCpltCallback(hi2c);
//	}
//}
//
///**
// * @brief  DMA I2C Memory Read process complete callback
// * @param  hdma: DMA handle
// * @retval None
// */
//static void I2C_DMAMemReceiveCplt(DMA_HandleTypeDef *hdma)
//{
//	I2C_HandleTypeDef* hi2c =
//			(I2C_HandleTypeDef*) ((DMA_HandleTypeDef*) hdma)->Parent;
//
//	/* Generate Stop */
//	hi2c->Instance->CR1 |= I2C_CR1_STOP;
//
//	/* Disable Last DMA */
//	hi2c->Instance->CR2 &= ~I2C_CR2_LAST;
//
//	/* Disable Acknowledge */
//	hi2c->Instance->CR1 &= ~I2C_CR1_ACK;
//
//	/* Disable DMA Request */
//	hi2c->Instance->CR2 &= ~I2C_CR2_DMAEN;
//
//	hi2c->XferCount = 0;
//
//	/* Wait until BUSY flag is reset */
//	if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_FLAG)
//			!= HAL_OK)
//	{
//		hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
//	}
//
//	hi2c->State = HAL_I2C_STATE_READY;
//
//	/* Check if Errors has been detected during transfer */
//	if (hi2c->ErrorCode != HAL_I2C_ERROR_NONE)
//	{
//		HAL_I2C_ErrorCallback(hi2c);
//	}
//	else
//	{
//		HAL_I2C_MemRxCpltCallback(hi2c);
//	}
//}

/**
 * @brief  DMA I2C communication error callback.
 * @param  hdma: DMA handle
 * @retval None
 */
static void I2C_DMAError(DMA_HandleTypeDef *hdma)
{
	I2C_HandleTypeDef* hi2c =
			(I2C_HandleTypeDef*) ((DMA_HandleTypeDef*) hdma)->Parent;

	/* Disable Acknowledge */
	hi2c->Instance->CR1 &= ~I2C_CR1_ACK;

	hi2c->XferCount = 0;

	hi2c->State = HAL_I2C_STATE_READY;

	hi2c->ErrorCode |= HAL_I2C_ERROR_DMA;

	HAL_I2C_ErrorCallback(hi2c);
}

/**
 * @brief  This function handles I2C Communication Timeout.
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @param  Flag: specifies the I2C flag to check.
 * @param  Status: The new Flag status (SET or RESET).
 * @param  Timeout: Timeout duration
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_WaitOnFlagUntilTimeout(I2C_HandleTypeDef *hi2c,
		uint32_t Flag, FlagStatus Status, uint32_t Timeout)
{
	uint32_t tickstart = 0;

	/* Get tick */
	tickstart = HAL_GetTick();

	/* Wait until flag is set */
	if (Status == RESET)
	{
		while (__HAL_I2C_GET_FLAG(hi2c, Flag) == RESET)
		{
			/* Check for the Timeout */
			if (Timeout != HAL_MAX_DELAY)
			{
				if ((Timeout == 0) || ((HAL_GetTick() - tickstart) > Timeout))
				{
					hi2c->State = HAL_I2C_STATE_READY;

					/* Process Unlocked */
					__HAL_UNLOCK(hi2c);

					return HAL_TIMEOUT;
				}
			}
		}
	}
	else
	{
		while (__HAL_I2C_GET_FLAG(hi2c, Flag) != RESET)
		{
			/* Check for the Timeout */
			if (Timeout != HAL_MAX_DELAY)
			{
				if ((Timeout == 0) || ((HAL_GetTick() - tickstart) > Timeout))
				{
					hi2c->State = HAL_I2C_STATE_READY;

					/* Process Unlocked */
					__HAL_UNLOCK(hi2c);

					return HAL_TIMEOUT;
				}
			}
		}
	}
	return HAL_OK;
}

/**
 * @brief  This function handles I2C Communication Timeout for Master addressing phase.
 * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
 *         the configuration information for I2C module
 * @param  Flag: specifies the I2C flag to check.
 * @param  Timeout: Timeout duration
 * @retval HAL status
 */
static HAL_StatusTypeDef I2C_WaitOnMasterAddressFlagUntilTimeout(
		I2C_HandleTypeDef *hi2c, uint32_t Flag, uint32_t Timeout)
{
	uint32_t tickstart = 0;

	/* Get tick */
	tickstart = HAL_GetTick();

