ntonjeta/Nodo-Sensore/src/cal/src/phy/pmd/lib/i2c_helper/stm32f4xx_i2c_helper_hal.c
	while (__HAL_I2C_GET_FLAG(hi2c, Flag) == RESET)
	{
		if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_AF) == SET)
		{
			/* Generate Stop */
			hi2c->Instance->CR1 |= I2C_CR1_STOP;

			/* Clear AF Flag */
			__HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

			hi2c->ErrorCode = HAL_I2C_ERROR_AF;
			hi2c->State = HAL_I2C_STATE_READY;

			/* Process Unlocked */
			__HAL_UNLOCK(hi2c);

			return HAL_ERROR;
		}

		/* Check for the Timeout */
		if (Timeout != HAL_MAX_DELAY)
		{
			if ((Timeout == 0) || ((HAL_GetTick() - tickstart) > Timeout))
			{
				hi2c->State = HAL_I2C_STATE_READY;

				/* Process Unlocked */
				__HAL_UNLOCK(hi2c);

				return HAL_TIMEOUT;
			}
		}
	}
	return HAL_OK;
}

/**
 * @}
 */

/**
 * @brief Set dmaUsed variable for the correct i2c periph
 * @param in hi2c I2c Handler
 * @retval none
 */
static void setDmaUsed(I2C_HandleTypeDef* hi2c, uint8_t newVal)
{
	if (hi2c->Instance == I2C1)
	{
		HELPER_I2C1_dmaUsed = newVal;
	}
	else if (hi2c->Instance == I2C2)
	{
		HELPER_I2C2_dmaUsed = newVal;
	}
	else if (hi2c->Instance == I2C3)
	{
		HELPER_I2C3_dmaUsed = newVal;
	}
}

/**
 * @brief Get dmaUsed variable for the correct i2c periph
 * @param in hi2c I2c Handler
 * @retval none
 */
static uint8_t getDmaUsed(I2C_HandleTypeDef* hi2c)
{
	if (hi2c->Instance == I2C1)
	{
		return HELPER_I2C1_dmaUsed;
	}
	else if (hi2c->Instance == I2C2)
	{
		return HELPER_I2C2_dmaUsed;
	}
	else if (hi2c->Instance == I2C3)
	{
		return HELPER_I2C3_dmaUsed;
	}
	return 0;
}

#endif /* HAL_I2C_MODULE_ENABLED */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
